{ 
    "_id" : ObjectId("57632b61009f08db1623b606"), 
    "name" : "BYAManager", 
    "url" : "https://github.com/Ks89/BYAManager", 
    "iconPath" : "assets/images/projects/project_icons/byamanager.png", 
    "description" : "BYAManager is a personal project that i realized in 2011 and updated more times during the years. It's a Multi-Platform and Multi-Language software dedicated to the \"Apple World\", that i developed for the blog called BiteYourApple.\nThis software is a GUI to download iOS firmwares and iTunes versions with some extra features.\nIt's legal, obviously, because all files are on Apple server. BYAManager gets files directly from Apple server to you.\n<br/>\nIt's available in 3 languages: ITALIAN, ENGLISH and CZECH\n<br/>\nThe entire list of features is available <a href=\"https://github.com/Ks89/BYAManager#features\">HERE</a>.\n<br/>\nBYAManager uses <a href=\"https://github.com/Ks89/BYAUpdater\">BYAUpdater</a> to update itself automatically!\n<br/>\nI presented this software in 2011 <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a>\n<br/>\nAttention!!! I started this project on assembla.com with SVN. The source code and the commit's list are in Assembla in a private repository. This isn't important, because the code here on GitHub is better.\n<br/>\nI'm working on a Python script to sort the ipsw's links in the database.\nThis project is available <a href=\"https://github.com/Ks89/BYAMSorter\">HERE</a>. \nIn the future, i want to integrate this script in BYAManager.\n<br/>\n<b>This software requires Java 8 or above and an internet connection</b>", 
    "shortDescription" : "short description 1", 
    "tags" : [
        "java se", 
        "maven", 
        "university"
    ], 
    "changelog" : "<ul>\n<li>NUOVA FUNZIONE: aggiunto nuovo parametro eseguendo BYAManager tramite linea di comando. Comunque si tratta una funzione da utenti esperti e che serve più a me che ad altri ;)</li>\n<li>RISOLTO BUG MINORE: ultimo bug conosciuto da tempo, risolto. Cioè, forzando l'aggiornamento del db o del programma, l'interfaccia grafica non si congela più per qualche secondo. Ora non ne conosco di rilevanti.</li>\n</ul>\n\n<h5>0.9.0 - 10/04/2015</h5>\n\n<ul>\n<li>NUOVA FUNZIONE: ora se Apple rilascia un nuovo dispositivo, es Apple Watch, non dovrò far uscire un aggiornamento del programma (es la versione 0.9.1), ma mi basterà modificare i dati sul mio server, così magicamente, nei menu a tendina del programma, appariranno le scritte coi nomi commerciali di questi prodotti Apple (è comunque richiesto un riavvio, dopo la mia modifica, ovvio ;))</li>\n</ul>\n\n<h5>0.8.0 - 06/04/2015</h5>\n\n<ul>\n<li>PREMESSA: da diversi mesi Apple rilascia le versioni di iTunes anche con link https. Inoltre, ha fatto si che tutte le versioni di iTunes siano scaricabili con https. Infatti, ora si può scaricare tutte le versioni di iTunes sia tramite collegamento http, sia https. Quindi, è evidente che vada verso https.\nBYAManager non è stato pensato per supportare connessioni https, così ho dovuto estendere il programma e potenziare notevolmente il sistema di download.</li>\n<li>LA MIA SOLUZIONE: In questa versione ho aggiunto proprio la possibilità di scaricare file via https (per ora senza accelerazione dei download). Questa funzione è già abilitata, ma per una questione di sicurezza, cercherò di usare solo link http, fino a che Apple non rilascerà solo versioni con https. Fino a questo giorno, continuerò a migliorare la parte https, in preparazione di quel momento.\nPoiché non so quando avverrà quel momento, ho deciso di aggiungere il supporto e abilitarlo direttamente nella versione 0.8.0. Se apple rilascerà il nuovo iOS (magari per l'Apple Watch) o iTunes SOLO via https, non servirà aggiornare il programma, poiché l'ho già preparato per quel momento grazie alla versione 0.8.0.</li>\n</ul>\n\n<h5>0.7.0 - 03/04/2015</h5>\n\n<ul>\n<li>Nuovissimo sistema di logging, per creare il file BYAManager.log e portato anche su BYAUpdater.</li>\n<li>Aggiornamento librerie per il download dei file.</li>\n<li>Riabilitato il proxy HTTP nelle impostazioni (attenzione assicurasi di trovare un proxy a prestazioni elevate).</li>\n<li>Corretto bug che lanciava messaggio d'errore durante la reinizializzazione del programma. In realtà la funzionalità era ok, ma c'era un messaggio d'errore inutile.</li>\n</ul>\n\n<h5>0.6.0 - 02/04/2015</h5>\n\n<ul>\n<li>Definitivamente corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux e anche Windows, presente da anni. Ho cambiato proprio il metodo per farlo, usando le nuove funzioni di java.</li>\n<li>Miglioramento generale delle performance nel processo di download.</li>\n<li>Completamente rifatto il sistema di connessione al server.</li>\n<li>Completamente rivisto il sistema per il download dei firmware e itunes. Ora è più facile da estendere per riabilitare i proxy, nella 0.7.0.</li>\n</ul>\n\n<h5>0.5.6 - 03/30/2015</h5>\n\n<ul>\n<li>Corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux, presente da anni.</li>\n<li>NOTA BENE per gli utenti Windows: assicuratevi di eseguire BYAManager.jar da una cartella in cui nel percorso non appaiono spazi. E' un bug che ho corretto per MAC OSX e LINUX, mentre per Windows ci vuole ancora un po' di pazienza. Devo trovare un attimo libero e lo correggo facilmente.</li>\n</ul>\n\n<h5>0.5.5 - 03/29/2015</h5>\n\n<ul>\n<li>Cambiamento del server che gestisce gli aggiornamenti. Non avendo più il precedente, tutte le versioni di questo programma (prima della 0.5.5) non sono più supportate, sia nel funzionamento, sia negli aggiornamenti. </li>\n<li>Aggiornate dipendenze varie di librerie usate internamente.</li>\n</ul>\n\n<h5>0.5.4 - 10/21/2014</h5>\n\n<ul>\n<li>Aggiornato ai nuovi dispositivi</li>\n</ul>\n\n<h5>0.5.3 - 09/29/2014</h5>\n\n<ul>\n<li>Versione uscita dopo più di 2 anni di attesa per rendere di nuovo funzionante il programma.</li>\n<li>Aggiunti nuovi dispositivi e database</li>\n<li>Richiede Java 8 o superiore</li>\n<li>Aggiornate tutte le librerie interne</li>\n<li>Attenzione: l'auto-aggiornamento di itunes non va perchè semplicemente apple cambia metodo ogni 2 secondi ed è impossibile fare un sistema davvero efficace. Invece, quello dei firmware non ha mai avuto problemi in anni e anni XD</li>\n</ul>\n\n<h5>0.5.2 - 04/06/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>La colonna della tabella chiamata \"Versione\" non ha piu' nessun logo a fianco. Il logo del file ipsw e' stato spostato nella prima colonna, nel caso in download sia di un firmware.</li>\n<li>Aggiunti i pulsanti per eseguire le azioni di spostamento ed esecuzione</li>\n<li>Aggiunta la voce nel popup (prima era chiamata COMING SOON) per disabilitare il controllo della sha1</li>\n</ul>\n\n<p>NOVITA’ IN FUNZIONALITA'</p>\n\n<ul>\n<li>Comando update-software finalmente completato e funzionante (in realta' andava anche nella 0.5.1 :) anche se con alcuni possibili errori)</li>\n<li>Cliccando col tasto destro su una riga della tabella (con un download in corso o in pausa) si puo' scegliere se disabilitare la verifica della SHA1 al termine del download. Questa procedura (verifica dell'hash tramite algoritmo sha1, identificata dall'icona fucsia col punto esclamativo) assicura la correttezza del file scaricato, ma potrebbe richiedere del tempo ( a volta anche un minuto) e un notevole spreco di risorse. Vista la crescente affidabilita' del programma, ho deciso di dare all'utente la possibilita' di disabilitare la procedura per ottenere il file desiderato piu' rapidamente.</li>\n<li>Aggiunta tutta la logica per gestire le azioni di esecuzione e spostamento dei download termimati</li>\n<li>Aggiunto GOD BETA1 (Guardian of download) per tenere sotto controllo i download, la loro velocita' e il fatto che alcuni processi non si blocchino senza motivo</li>\n</ul>\n\n<h5>0.5.1 - 03/28/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>Rimosso il limite di ridimensionamento dello sfondo della finestra del programma per risoluzioni superiori a 1920x<strong><em>. - Infatti, fino ad ora, la finestra principale del programma mostrava lo sfondo con una dimensione massima di 1920x</em></strong>, con quelle superiori appariva lo sfondo grigio. Ora non accade più. Adesso lo sfondo viene disegnato in modo molto piu’ efficiente.</li>\n<li>Rifatte le icone download, validation ecc… nella tabella</li>\n<li>Aggiunti i bordi nei popupmenu (come il menu file, help ecc…in alto oppure quello che appare cliccando col tasto destro su un download nella tabella) e migliorati i “separator” tra gli elementi di questi menu.</li>\n<li>Aggiunta voce nel popupmenu della tabella chiamata “coming soon”, che in futuro sara’ sostituita dalla reale funzione </li>\n<li>Ora la velocità globale non appare più come “0″, ma se è 0 perchè i download sono fermi o non ce ne sono non appare nulla (vuoto)</li>\n<li>La finestra preferenze appare a centro schermo e da ora se dovessi modificare la dimensione predefinita di una finestra il posizionamento al centro avviene in automatico (cosi’ evito i problemi col pannello delle preferenze).</li>\n<li>Migliorata SplashScreen per adattarla meglio alla grafica del programma</li>\n<li>Cambiata dimensione predefinita del programma (+ lungo) e ricentrata.</li>\n<li>Aggiunto autoridimensionamento delle colonne della tabella (ancora da perfezionare)</li>\n<li>Nella colonna della velocita’ ora non appare nulla se il download e’ in pausa (velocita’ ==0)</li>\n<li>Colonna “ora fine” rimossa e migliorata quella del tempo rimanente che ora dice h, m e s in modo preciso.</li>\n</ul>\n\n<p>NOVITA’ GENERICHE</p>\n\n<ul>\n<li>Praticamente riscritta la gestione della GUI per essere piu’ adattabile.</li>\n<li>Aggiornamento delle librerie di terze parti</li>\n<li>Aggiunto comando update-software, ma ancora in beta e non provato in caso di aggiornamento reale</li>\n<li>La fase di verifica nuove versioni software non richiede piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>La fase di verifica corretteza file JAR durante un agg software non richiedono piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>Pulizia ed ottimizzazione del codice.</li>\n<li>Aggiunta suddivisione tra stati merging e validation. Il primo avviene sempre alla fine di ogni download (identificato dal simbolo +) e consiste nell’unire i vari file part che compongono il download per fornire il file desiderato. Il secondo può avvenire dopo al merging (per ora è sempre obbligatorio, nella 0.6.0 non lo sarà più) e consiste nel verificare tramite l’algoritmo SHA1 la correttezza del file scaricato. Questo metodo è lo stesso che consiglia Apple e che anche iTunes, probabilmente, esegue.</li>\n</ul>\n\n<p>CORREZIONE BUG (BUGFIX)</p>\n\n<ul>\n<li>Rimossa una lettura+scrittura di un file di oltre 600KB di testo ad ogni verifica degli aggiornamenti con Apple. Ora l’intera operazione è svolta in modo super-efficiente e in un tempo praticamente impercettibile. Questo permette di rendere molto piu’ veloce la verifica degli aggiornamenti dei firmware con Apple (un grazie allo sviluppatore della libreria che uso per averla aggiornata in modo da risolvere il mio problema , dopo averlo contattato via email, da solo non ci sarei mai riuscito!!!).</li>\n<li>Corretto GRAVISSIMO bug durante l’avvio e di conseguenza non avviene più nessuna scrittura superflua sul disco. </li>\n<li>CORRETTO GRAVE BUG CHE IMPEDIVA L’AUTO-AGGIORNAMENTO DEL PROGRAMMA</li>\n<li>Corretto bug nella gestione del pulsante per verificare gli aggiornamenti software</li>\n<li>Corretto bug su abilitazione/disabilitazione delle voci nel menu help: agg software e agg database</li>\n<li>Corretto problema nella generazione dei path sul disco per i pc con la partizione di sistema diversa da “C” (windows)</li>\n</ul>\n\n<h5>0.5.0.0 - 03/19/2012</h5>\n\n<p>Changelog 0.5.0.0 FINALE (news rispetto la RC2): </p>\n\n<ul>\n<li>Testato per bene il sistema di autoaggiornamento database e del programma</li>\n<li>Migliorato il menu del programma con una divisione delle voci più intelligente</li>\n<li>Messaggi nella splashscreen tradotti in inglese e italiano</li>\n<li>Aggiunta traduzione inglese sui nuovi componenti della gui</li>\n</ul>\n\n<p>Changelog 0.5.0 RC2:</p>\n\n<ul>\n<li>Corretto grave bug nell'aggiornamento delle versioni di iTunes perche' non caricava il db aggiornato all'avvio, ma quello precedente. In realta' mancava un sacco di codice per questa parte :) errore mio XD.</li>\n<li>Corretto grave bug nell'aggiornamento delle preferenze, sembrava risolto ma e' tornato ancora :) Ora spero di averlo rimosso.</li>\n</ul>\n\n<p>Changelog 0.5.0 RC1:</p>\n\n<ul>\n<li>Aggiunto download versioni di iTunes e preparato gia' per i tool per il Jailbreak</li>\n<li>Aggiunto sistema di autoaggiornamento delle versioni di iTunes direttamente dal server Apple.</li>\n<li>Il database usato dal programma e' ora compresso per dimezzarne la dimensione. Questo porta alla novita' seguente...</li>\n<li>Ridotto il consumo di banda (internet) durante l'avvio del programma (AD OGNI AVVIO).</li>\n<li>Corretto grave bug nel sistema di aggiornamento delle preferenze (presente dalla 0.4.0 alla 0.5.0beta4 [non rilasciata al pubblico]).</li>\n<li>Funzionante \"update-db\" da linea di comando. Grazie ad esso e' possibile risolvere problemi sul caricamento del database al momento dell'avvio in tutta semplicità. Questo comando rimuove i database esistenti e scarica le versioni piu' recenti dal server, dopodiche' cerca anche di aggiornarli contattando Apple. Terminato il processo, il software viene chiuso e al riavvio (normale con doppio clic) avrai i database aggiornati.</li>\n<li>Corretto il bug: \"se 4 i temp file vengono rinominati manualmente o a causa di un problema in BYAM e poi avvio il prog, lui giustamente non li carica, ma non li rimuove nemmeno, sia nel caso in cui il download sia incompleto sia nel caso fosse terminato. Ovviamente, se il firmware non puo' essere trovato, i sui part non servono e devono essere rimossi.\"</li>\n<li>Corretto il bug: \"Se per errore il file .sha si trova in temp al prossimo riavvio veniva cancellato, ora invece viene spostato tra i download ed appare una richiesta all'utente su che fare\"</li>\n<li>Rivisto il pannello delle impostazioni con la possibilita' di personalizzare le notifiche e inserire i valori per il Proxy</li>\n<li>Separati i file delle traduzioni tra normale, preferenze e messaggi di notifica.</li>\n<li>GUI separata dalla logica del programma per il 50%, il processo, lento e complicato richiedera' del tempo per essere perfezionato</li>\n<li>Cambiato ordine dei firmware, dal piu' recente al piu' vecchio</li>\n<li>Cambiato ordine dispositivi in modo piu' intelligente e aggiunti nuovi nomi commerciali AppleTV3 e iPad3</li>\n<li>Creato messaggio con spunta che avvisa alla prima riduzione ad icona</li>\n<li>Aggiunto il supporto ad ArchLinux 2011 (ultmi update con kernel 3.1.x.x) sia con KDE sia con Gnome</li>\n<li>Ora si puo' rinizializzare il programma anche durante la fase di aggiornamento del database</li>\n<li>Aggiunte le icone di itunes nella tabella</li>\n<li>Cambiate alcune scritte nella splashscreen </li>\n<li>Corretti bug minori</li>\n<li>Ottimizzazione di alcune procedure e migliorato il codice per renderlo + facile da aggiornare in futuro</li>\n</ul>\n\n<h5>0.4.0 - 01/06/2012</h5>\n\n<p>CHANGELOG </p>\n\n<ul>\n<li>Ora il programma si chiamerà BYAManager 0.4.0 e non più beta4, visto che questa versione non merita il nome beta, dopotutto è stabile.</li>\n<li>Aggiunta la spashScreen prima dell'avvio dell'interfaccia grafica del programma</li>\n<li>RISOLTO IMPORTANTISSIMO BUG NEL SISTEMA DI AUTOAGGIORNAMENTO DEL DATABASE DEI FIRMWARE E DIVERSE NOVITA' PER RENDERLO ANCORA PIU' AUTOMATIZZATO </li>\n<li>CON LA  0.4.0, DOPO AVERLO SCARICATO, IL NUMERO DI RIAVVI PER INSTALLARE IL NUOVO DATABASE SI E' RIDOTTO DRASTICAMENTE, ORA FA TUTTO LUI ECCETTO UN CASO PARTICOLARE CHE NON SI PUO' EVITARE (POCHI MINUTI/ORE DOPO L'USCITA DI NUOVI FIRMWARE/DISPOSITIVI).</li>\n<li>RIABILITATI GLI AUTOAGGIORNAMETI (IN BETA 3 HO DISATTIVATO TUTTO) PER LE VERSIONI SUPERIORI ALLA 0.4.0 (SISTEMA 1000 VOLTE PIU' SICURO RISPETTO QUELLO USATO PRIMA DELLA BETA3) </li>\n<li>Interrompendo download al 99% durante unione delle 4 parti, al riavvio il processo continua correttamente, a differenza della beta3</li>\n<li>Interrompendo download al 99% durante la validation, al riavvio il processo viene verificato chiedendo all'utente cosa fare</li>\n<li>Cambiati i nomi commerciali aggiungendo gli spazi e la scritta \"touch\" con la G su consiglio di Filippo Rossi di BYAStaff</li>\n<li>Il pannello preferenze non manda + i download in pausa nemmeno modificando le impostazioni, perchè esse saranno applicate al riavvio</li>\n<li>Ora si puo' cambiare il percorso dei download e poi continuare a scaricare nella cartella prima del cambiamento senza problemi per poter far si che le modifiche abbiamo effetto bisogna per forza riavviare il programma.</li>\n<li>Pannello delle preferenze completamente rivisto e gestito in modo differente e migliore.</li>\n<li>Si puo' cambiare il percorso di download scrivendo direttamente nel campo di testo nel pannello preferenze</li>\n<li>Su OSX ora appare il nome di BYAManager nella barra in alto e non + logica.main</li>\n<li>Corretto bug grafico nella toolbar che causava la rimozione dell'effetto arrotondato</li>\n<li>Ora i testi presenti nei pulsanti verdi e personalizzati appaiono ben centrati</li>\n<li>Modificato e ottimizzato il sistema di gestione dei pulsanti della toolbar (risolto un bug su windows7 che causava un comportamento anomalo nella versione prebeta3 rilasciata solo allo staff di BYA. Per nasconderlo temporaneamente avevo adottato una tecnica folle che richiedeva troppe risorse)</li>\n<li>Rimosso i pulsanti STOP e anche la riga nel popup sulla tabella. Ora un pulsante ferma e rimuove automaticamente, tutto in uno</li>\n<li>Rimosse diverse immagini presenti nel programma che gestivano lo stato STOP, riducendo la dimensione del file jar</li>\n<li>Aggiunta la traduzione in ceco inviatami da un utente</li>\n<li>Durante la fase di validation non si può più mettere in pausa o cancellare un download (come giusto che sia)</li>\n<li>Cambiamenti alle colonne della tabella (IMPORTANTE per i prossimi aggiornamenti), tra cui: la versione di iOS e la build sono integrate nella stessa colonna \"versione\" e dispositivo e' sostituito da \"tipo\".</li>\n<li>Aggiunta voce per ridurre ad icona il programma nel menu file</li>\n<li>Corretto bug nella gestione del Logger</li>\n<li>Corretti altri bug grafici minori e poco visibili</li>\n<li>Corretti altri bug funzionali minori</li>\n</ul>\n\n<h5>Beta 3 - 12/28/2011</h5>\n\n<ul>\n<li>AGGIUNTA l'interfaccia grafica in stile BYA e riposizionati molti elementi (cambiata la textfield nelle impostazioni con un menu a tendina e personalizzato ogni elemento grafico).</li>\n<li>AGGIUNTA la velocità globale di download (somma delle velocità di ogni singolo download ed aggiornata ogni secondo).</li>\n<li>AGGIUNTA la compatibilità con JAVA 7</li>\n<li>AGGIUNTA la possibilità di inviare comandi via terminale per avviare il programma secondo diverse modalità, proprio come in redSn0w (utile per risolvere problemi di avvio e per reinizializzare/aggiornare il programma)</li>\n<li>OTTIMIZZAZIONE dell'intero programma e di alcune procedure di ricerca</li>\n<li>RIMOSSA (momentaneamente) la splash screen in attesa di una versione migliore</li>\n<li>AGGIUNTA la doppia lingua in base a quella dell'OS (italiano, inglese)</li>\n<li>MIGLIORATO il sistema di autoaggiornamento</li>\n<li>CORRETTO bug gravissimo che causava consumi spropositati di CPU...ora si attesta tra l'8 e il 20% con tantissimi download ;) direi che è perfetto.</li>\n<li>INTERAMENTE riscritto il sistema di Download per supportare connessioni contemporanee thread-safe aumentando di un centinaio di volte le prestazioni e riducendo moltissimi tempi di attesa non giustificati.</li>\n<li>INTERAMENTE rivisto il codice di tutto il programma (usando ove possibile i Design Pattern), ottimizzazione spinta tanto da ridurre di ben 30MB il consumo della RAM, pulendo/semplificando anche il codice e permettendomi di aggiornarlo e modificarlo più velocemente.</li>\n<li>Rivisto il progetto del programma per aumentare la riusabilita', preparandomi per il riciclo del codice nel caso sviluppassi un nuovo progetto per BYA.</li>\n<li>INTERAMENTE riscritto il sistema per calcolare velocità, tempo rimanente e data fine che ora avviene nello stesso istante (ogni secondo) per tutti i download in lista permettendo di stimare facilmente la velocità globale senza commettere errori eccessivi. Questo novità porta con sè un'enorme ottimizzazione della RAM usata, infatti ora vengono risparmiati più di 10 MB semplicemente riscrivendo questa piccola, ma importantissima, funzione. C'è ancora lavoro da fare per ridurre gli sprechi, ma per ora è più che accettabile XD.</li>\n<li>Corretto il bug presente nelle versioni alpha8, alpha9, beta1 e beta2 che causava un \"lampeggio\" della tabella quando si cancellava un download completato e sopra di esso ve ne era un altro completato (senza altri in stati differenti). C'è voluto un sacco ma finalmente ho trovato il difetto, bastava aggiungere una sola riga di codice per correggerlo ;)</li>\n<li>Diversi bug (ALCUNI RILEVANTI) corretti in tutto il programma</li>\n<li>PULIZIA del codice e miglioramenti vari</li>\n<li>Possibilità di scegliere come visualizzare la dimensione dei file nella tabella tra Byte, Multipli del Byte (tiene conto del fattore 1000) [PREDEFINITO per comodità] o Multipli del Binary Byte (tiene conto del fattore 1024). Quindi, aggiunto menu' a tendina del pannello delle preferenze.</li>\n</ul>\n\n<h5>Beta 2 - 10/24/2011</h5>\n\n<ul>\n<li>Migliorata la grafica aggiungendo icone nella tabella, riducendo la dimensione della toolbar (impedendone anche lo spostamento), riprogrettando il pannello impostazioni con l'uso di schede.</li>\n<li>Dimensione del download nella tabella non viene mostrata in byte ma in KB, MB o GB. E' comunque possibile ripristinare la visione precedente tramite il pannello \"impostazioni\" e riavviando il programma.</li>\n<li>Su mac OSX ora l'app nella dock appare con l'icona corretta e col nome giusto</li>\n<li>Aggiunta la data di ultimo aggiornamento database</li>\n<li>Completamente rivisito e corretto il sistema di aggiornamento database automatico ogni 24ore o manuale cliccando sul pulsante apposito...ora funziona e non presenta più i bug riscontrati nella versione beta1 con l'uscita di iOS5</li>\n<li>Il sistema di auto-aggiornamento ora verificherà anche la correttezza dell'updater e della nuova versione del programma tramite SHA, per evitare di eseguire applicazioni pericolose.</li>\n<li>Moltissimi bugfix in tutto il programma e in tutte le funzionalità</li>\n<li>Migliorate le prestazioni</li>\n<li>Inserito sistema totalmente anonimo per scopi statistici sull'uso del programma</li>\n<li>e altre modifiche che ora non mi vengono in mente ma che ci sono di certo... XD</li>\n</ul>", 
    "releases" : "<ul>\n<li>04/11/2015 - <b>BYAManager 1.0.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v1.0.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-100.html\">HERE</a></li>\n<li>04/10/2015 - <b>BYAManager 0.9.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.9.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-090.html\">HERE</a></li>\n<li>04/06/2015 - <b>BYAManager 0.8.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.8.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-080.html\">HERE</a></li>\n<li>04/03/2015 - <b>BYAManager 0.7.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.7.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-070.html\">HERE</a></li>\n<li>04/02/2015 - <b>BYAManager 0.6.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.6.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/bya-manager-060.html\">HERE</a></li>\n<li>03/30/2015 - <b>BYAManager 0.5.6</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.6\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/byamanager-056.html\">HERE</a> </li>\n<li>03/29/2015 - <b>BYAManager 0.5.5</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.5\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/changelog-0.html\">HERE</a></li>\n<li>10/21/2014 - <b>BYAManager 0.5.4</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/10/changelog-0.html\">HERE</a></li>\n<li>09/29/2014 - <b>BYAManager 0.5.3</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/09/byamanager-053.html\">HERE</a><br></li>\n<li>04/06/2012 - <b>BYAManager 0.5.2</b> public <a href=\"http://www.biteyourapple.net/2012/05/12/esclusiva-bya-bya-manager-0-5-2/#more-43579\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/04/anteprima-byamanager-052.html\">HERE</a></li>\n<li>04/05/2012 - <b>BYAManager 0.5.2 RC1</b> public via Twitter and auto-update</li>\n<li>03/28/2012 - <b>BYAManager 0.5.1</b> public <a href=\"http://www.biteyourapple.net/2012/04/06/esclusiva-bya-bya-manager-0-5-1/#more-43275\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/03/anteprima-byamanager-051.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0.0</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-050.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC2</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC1</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 beta 1</b> only for 3 beta testers</li>\n<li>03/13/2012 - <b>BYAManager 0.5.0.0 Beta5</b> only for beta testers</li>\n<li>03/09/2012 - <b>BYAManager 0.5.0.0 Beta3</b> only for beta testers </li>\n<li>02/24/2012 - <b>BYAManager 0.4.1.0 (or 0.5.0.0 Beta2)</b> only for beta testers</li>\n<li>01/06/2012 - <b>BYAManager 0.4.0 (or Beta 4)</b> public <a href=\"http://www.biteyourapple.net/2012/01/06/esclusiva-bya-biteyourapple-manager-0-4-0/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-beta4.html\">HERE</a></li>\n<li>12/28/2011 - <b>BYAManager Beta 3</b> public <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta3-preview.html\">HERE</a></li>\n<li>10/24/2011 - <b>BYAManager Beta 2</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta2.html\">HERE</a> </li>\n<li>10/10/2011 - <b>BYAManager Beta 1</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta1.html\">HERE</a></li>\n<li>10/03/2011 - <b>BYAManager Beta 0.3</b> private</li>\n<li>08/04/2011 - <b>BYAManager Alpha 4</b> private</li>\n<li>07/31/2011 - <b>BYAManager Alpha 3</b> private</li>\n</ul>", 
    "features" : "<h4>You can:</h4>\n\n<ul>\n<li>download files via http and https, also with BYAManager in background (minimized)</li>\n<li>download one or more files at the same time at full speed (Download Accelerator), with multiple processes to bypass server's limitations</li>\n<li>play/pause/stop/cancel downloads, using a list of available iOS Firmware and iTunes versions in a local database</li>\n<li>enable/disable sha1 check (enabled by default)</li>\n<li>search new BYAManager's versions or new database's versions</li>\n<li>change settings, for example: path of the download folder, proxy, measurement unit, language, buffer size, notifications, and so on</li>\n<li>restore settings to default values</li>\n<li>open the download folder, directly from BYAManager</li>\n<li>re-download files in the list directly in the browser, or in other programs</li>\n<li>control some important features running BYAManager via Command Line with a complete tutorial executing \"BYAManager.jar help\"</li>\n<li>move a completed download into the iTunes folder (only on Mac and Windows) to be able to update/restore your device from iTunes without re-download the file \".ipsw\".</li>\n</ul>\n\n<h4>BYAManager:</h4>\n\n<ul>\n<li>checks and updates itself automatically every 24 hours, with BYAUpdater</li>\n<li>checks and updates automatically the databse every 24 hours</li>\n<li>downloads files at full speed using multiple process</li>\n<li>checks the integrity os a file with hash algoririthm (SHA1).</li>\n<li>tries to restore incompleted/damaged files, during the startup of the program</li>\n<li>checks if a file has been downloaded before</li>\n<li>logs every actions in a file called BYAManager.log, near the executable</li>\n</ul>", 
    "futureExtensions" : "<h4>Functionalities</h4>\n\n<ul>\n<li>Add a pattern to the sha check </li>\n<li>Improve the logic to check the free space on the disk</li>\n<li>Dinamically update the list of available firmwares and iTunes versions, without the requirement of \"restart BYAManager to apply\".</li>\n<li>Add social networks integration: Twitter, Facebook and so on</li>\n</ul>\n\n<h4>GUI</h4>\n\n<ul>\n<li>Create a new modern GUI to release BYAManager 2.0 (NOT IN SWING, but with other frameworks, like JavaFX)</li>\n<li>Create a custom GUI for the popup in the system tray</li>\n<li>Add in the GUI some informations to help the user to understand the state of every process</li>\n<li>Add the donate button in the GUI</li>\n</ul>", 
    "license" : "apache-v2", 
    "licenseText" : "<p>Copyright 2011-2015 Stefano Cappa</p>\n\n<p>Licensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at</p>\n\nhttp://www.apache.org/licenses/LICENSE-2.0\n\n<p>Unless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.</p>\n\n<p><br>\n<b>Created by Stefano Cappa</b></p>", 
    "visible" : true, 
    "lastUpdate" : ISODate("2013-07-15T22:00:00.000+0000"), 
    "gallery" : [
        {
            "thumb" : "assets/images/projects/byamanager/1.jpg", 
            "img" : "assets/images/projects/byamanager/1.jpg", 
            "description" : "Image 1"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/2.png", 
            "img" : "assets/images/projects/byamanager/2.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/3.png", 
            "img" : "assets/images/projects/byamanager/3.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/4.png", 
            "img" : "assets/images/projects/byamanager/4.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/5.png", 
            "img" : "assets/images/projects/byamanager/5.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/6.png", 
            "img" : "assets/images/projects/byamanager/6.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/7.png", 
            "img" : "assets/images/projects/byamanager/7.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/8.png", 
            "img" : "assets/images/projects/byamanager/8.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/9.png", 
            "img" : "assets/images/projects/byamanager/9.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/10.png", 
            "img" : "assets/images/projects/byamanager/10.png", 
            "description" : "Image 2"
        }, 
        {
            "thumb" : "assets/images/projects/byamanager/11.png", 
            "img" : "assets/images/projects/byamanager/11.png", 
            "description" : "Image 2"
        }
    ], 
    "projectHomeView" : {
        "carouselImagePath" : "http://placehold.it/1000x400", 
        "carouselText" : "sdjs fshfs fhfsdhf", 
        "thumbImagePath" : "http://placehold.it/720x300", 
        "thumbText" : "sfsfasf", 
        "bigThumbImagePath" : "http://placehold.it/500x500", 
        "bigThumbText" : "dasdasdas"
    }, 
    "authors" : [
        {
            "name" : "dasdasdas", 
            "surname" : "dsadasd", 
            "url" : "http://shjdjhdj", 
            "urlAvailable" : true
        }, 
        {
            "name" : "dsfdsgsdgd", 
            "surname" : "werewweggew", 
            "url" : "http://dsgwgewg", 
            "urlAvailable" : true
        }, 
        {
            "name" : "jiomdwqdqw", 
            "surname" : "iuytdgbpl,", 
            "url" : "http://mxiuwfybe", 
            "urlAvailable" : false
        }
    ]
}
{ 
    "_id" : ObjectId("57632b61009f08db1623b605"), 
    "name" : "SPF", 
    "url" : "https://github.com/deib-polimi/SPF2", 
    "iconPath" : "assets/images/projects/project_icons/spf.png", 
    "shortDescription" : "dsffsduhfsduaf asfyhasfuas fy8shfuiqw fUWQHBFUIWEBQ fewhfuwfnoeiwb ewuhfiewn", 
    "tags" : [
        "java se", 
        "maven", 
        "university"
    ], 
    "description" : "BYAManager is a personal project that i realized in 2011 and updated more times during the years. It's a Multi-Platform and Multi-Language software dedicated to the \"Apple World\", that i developed for the blog called BiteYourApple.\nThis software is a GUI to download iOS firmwares and iTunes versions with some extra features.\nIt's legal, obviously, because all files are on Apple server. BYAManager gets files directly from Apple server to you.\n<br/>\nIt's available in 3 languages: ITALIAN, ENGLISH and CZECH\n<br/>\nThe entire list of features is available <a href=\"https://github.com/Ks89/BYAManager#features\">HERE</a>.\n<br/>\nBYAManager uses <a href=\"https://github.com/Ks89/BYAUpdater\">BYAUpdater</a> to update itself automatically!\n<br/>\nI presented this software in 2011 <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a>\n<br/>\nAttention!!! I started this project on assembla.com with SVN. The source code and the commit's list are in Assembla in a private repository. This isn't important, because the code here on GitHub is better.\n<br/>\nI'm working on a Python script to sort the ipsw's links in the database.\nThis project is available <a href=\"https://github.com/Ks89/BYAMSorter\">HERE</a>. \nIn the future, i want to integrate this script in BYAManager.\n<br/>\n<b>This software requires Java 8 or above and an internet connection</b>", 
    "changelog" : "<ul>\n<li>NUOVA FUNZIONE: aggiunto nuovo parametro eseguendo BYAManager tramite linea di comando. Comunque si tratta una funzione da utenti esperti e che serve più a me che ad altri ;)</li>\n<li>RISOLTO BUG MINORE: ultimo bug conosciuto da tempo, risolto. Cioè, forzando l'aggiornamento del db o del programma, l'interfaccia grafica non si congela più per qualche secondo. Ora non ne conosco di rilevanti.</li>\n</ul>\n\n<h5>0.9.0 - 10/04/2015</h5>\n\n<ul>\n<li>NUOVA FUNZIONE: ora se Apple rilascia un nuovo dispositivo, es Apple Watch, non dovrò far uscire un aggiornamento del programma (es la versione 0.9.1), ma mi basterà modificare i dati sul mio server, così magicamente, nei menu a tendina del programma, appariranno le scritte coi nomi commerciali di questi prodotti Apple (è comunque richiesto un riavvio, dopo la mia modifica, ovvio ;))</li>\n</ul>\n\n<h5>0.8.0 - 06/04/2015</h5>\n\n<ul>\n<li>PREMESSA: da diversi mesi Apple rilascia le versioni di iTunes anche con link https. Inoltre, ha fatto si che tutte le versioni di iTunes siano scaricabili con https. Infatti, ora si può scaricare tutte le versioni di iTunes sia tramite collegamento http, sia https. Quindi, è evidente che vada verso https.\nBYAManager non è stato pensato per supportare connessioni https, così ho dovuto estendere il programma e potenziare notevolmente il sistema di download.</li>\n<li>LA MIA SOLUZIONE: In questa versione ho aggiunto proprio la possibilità di scaricare file via https (per ora senza accelerazione dei download). Questa funzione è già abilitata, ma per una questione di sicurezza, cercherò di usare solo link http, fino a che Apple non rilascerà solo versioni con https. Fino a questo giorno, continuerò a migliorare la parte https, in preparazione di quel momento.\nPoiché non so quando avverrà quel momento, ho deciso di aggiungere il supporto e abilitarlo direttamente nella versione 0.8.0. Se apple rilascerà il nuovo iOS (magari per l'Apple Watch) o iTunes SOLO via https, non servirà aggiornare il programma, poiché l'ho già preparato per quel momento grazie alla versione 0.8.0.</li>\n</ul>\n\n<h5>0.7.0 - 03/04/2015</h5>\n\n<ul>\n<li>Nuovissimo sistema di logging, per creare il file BYAManager.log e portato anche su BYAUpdater.</li>\n<li>Aggiornamento librerie per il download dei file.</li>\n<li>Riabilitato il proxy HTTP nelle impostazioni (attenzione assicurasi di trovare un proxy a prestazioni elevate).</li>\n<li>Corretto bug che lanciava messaggio d'errore durante la reinizializzazione del programma. In realtà la funzionalità era ok, ma c'era un messaggio d'errore inutile.</li>\n</ul>\n\n<h5>0.6.0 - 02/04/2015</h5>\n\n<ul>\n<li>Definitivamente corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux e anche Windows, presente da anni. Ho cambiato proprio il metodo per farlo, usando le nuove funzioni di java.</li>\n<li>Miglioramento generale delle performance nel processo di download.</li>\n<li>Completamente rifatto il sistema di connessione al server.</li>\n<li>Completamente rivisto il sistema per il download dei firmware e itunes. Ora è più facile da estendere per riabilitare i proxy, nella 0.7.0.</li>\n</ul>\n\n<h5>0.5.6 - 03/30/2015</h5>\n\n<ul>\n<li>Corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux, presente da anni.</li>\n<li>NOTA BENE per gli utenti Windows: assicuratevi di eseguire BYAManager.jar da una cartella in cui nel percorso non appaiono spazi. E' un bug che ho corretto per MAC OSX e LINUX, mentre per Windows ci vuole ancora un po' di pazienza. Devo trovare un attimo libero e lo correggo facilmente.</li>\n</ul>\n\n<h5>0.5.5 - 03/29/2015</h5>\n\n<ul>\n<li>Cambiamento del server che gestisce gli aggiornamenti. Non avendo più il precedente, tutte le versioni di questo programma (prima della 0.5.5) non sono più supportate, sia nel funzionamento, sia negli aggiornamenti. </li>\n<li>Aggiornate dipendenze varie di librerie usate internamente.</li>\n</ul>\n\n<h5>0.5.4 - 10/21/2014</h5>\n\n<ul>\n<li>Aggiornato ai nuovi dispositivi</li>\n</ul>\n\n<h5>0.5.3 - 09/29/2014</h5>\n\n<ul>\n<li>Versione uscita dopo più di 2 anni di attesa per rendere di nuovo funzionante il programma.</li>\n<li>Aggiunti nuovi dispositivi e database</li>\n<li>Richiede Java 8 o superiore</li>\n<li>Aggiornate tutte le librerie interne</li>\n<li>Attenzione: l'auto-aggiornamento di itunes non va perchè semplicemente apple cambia metodo ogni 2 secondi ed è impossibile fare un sistema davvero efficace. Invece, quello dei firmware non ha mai avuto problemi in anni e anni XD</li>\n</ul>\n\n<h5>0.5.2 - 04/06/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>La colonna della tabella chiamata \"Versione\" non ha piu' nessun logo a fianco. Il logo del file ipsw e' stato spostato nella prima colonna, nel caso in download sia di un firmware.</li>\n<li>Aggiunti i pulsanti per eseguire le azioni di spostamento ed esecuzione</li>\n<li>Aggiunta la voce nel popup (prima era chiamata COMING SOON) per disabilitare il controllo della sha1</li>\n</ul>\n\n<p>NOVITA’ IN FUNZIONALITA'</p>\n\n<ul>\n<li>Comando update-software finalmente completato e funzionante (in realta' andava anche nella 0.5.1 :) anche se con alcuni possibili errori)</li>\n<li>Cliccando col tasto destro su una riga della tabella (con un download in corso o in pausa) si puo' scegliere se disabilitare la verifica della SHA1 al termine del download. Questa procedura (verifica dell'hash tramite algoritmo sha1, identificata dall'icona fucsia col punto esclamativo) assicura la correttezza del file scaricato, ma potrebbe richiedere del tempo ( a volta anche un minuto) e un notevole spreco di risorse. Vista la crescente affidabilita' del programma, ho deciso di dare all'utente la possibilita' di disabilitare la procedura per ottenere il file desiderato piu' rapidamente.</li>\n<li>Aggiunta tutta la logica per gestire le azioni di esecuzione e spostamento dei download termimati</li>\n<li>Aggiunto GOD BETA1 (Guardian of download) per tenere sotto controllo i download, la loro velocita' e il fatto che alcuni processi non si blocchino senza motivo</li>\n</ul>\n\n<h5>0.5.1 - 03/28/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>Rimosso il limite di ridimensionamento dello sfondo della finestra del programma per risoluzioni superiori a 1920x<strong><em>. - Infatti, fino ad ora, la finestra principale del programma mostrava lo sfondo con una dimensione massima di 1920x</em></strong>, con quelle superiori appariva lo sfondo grigio. Ora non accade più. Adesso lo sfondo viene disegnato in modo molto piu’ efficiente.</li>\n<li>Rifatte le icone download, validation ecc… nella tabella</li>\n<li>Aggiunti i bordi nei popupmenu (come il menu file, help ecc…in alto oppure quello che appare cliccando col tasto destro su un download nella tabella) e migliorati i “separator” tra gli elementi di questi menu.</li>\n<li>Aggiunta voce nel popupmenu della tabella chiamata “coming soon”, che in futuro sara’ sostituita dalla reale funzione </li>\n<li>Ora la velocità globale non appare più come “0″, ma se è 0 perchè i download sono fermi o non ce ne sono non appare nulla (vuoto)</li>\n<li>La finestra preferenze appare a centro schermo e da ora se dovessi modificare la dimensione predefinita di una finestra il posizionamento al centro avviene in automatico (cosi’ evito i problemi col pannello delle preferenze).</li>\n<li>Migliorata SplashScreen per adattarla meglio alla grafica del programma</li>\n<li>Cambiata dimensione predefinita del programma (+ lungo) e ricentrata.</li>\n<li>Aggiunto autoridimensionamento delle colonne della tabella (ancora da perfezionare)</li>\n<li>Nella colonna della velocita’ ora non appare nulla se il download e’ in pausa (velocita’ ==0)</li>\n<li>Colonna “ora fine” rimossa e migliorata quella del tempo rimanente che ora dice h, m e s in modo preciso.</li>\n</ul>\n\n<p>NOVITA’ GENERICHE</p>\n\n<ul>\n<li>Praticamente riscritta la gestione della GUI per essere piu’ adattabile.</li>\n<li>Aggiornamento delle librerie di terze parti</li>\n<li>Aggiunto comando update-software, ma ancora in beta e non provato in caso di aggiornamento reale</li>\n<li>La fase di verifica nuove versioni software non richiede piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>La fase di verifica corretteza file JAR durante un agg software non richiedono piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>Pulizia ed ottimizzazione del codice.</li>\n<li>Aggiunta suddivisione tra stati merging e validation. Il primo avviene sempre alla fine di ogni download (identificato dal simbolo +) e consiste nell’unire i vari file part che compongono il download per fornire il file desiderato. Il secondo può avvenire dopo al merging (per ora è sempre obbligatorio, nella 0.6.0 non lo sarà più) e consiste nel verificare tramite l’algoritmo SHA1 la correttezza del file scaricato. Questo metodo è lo stesso che consiglia Apple e che anche iTunes, probabilmente, esegue.</li>\n</ul>\n\n<p>CORREZIONE BUG (BUGFIX)</p>\n\n<ul>\n<li>Rimossa una lettura+scrittura di un file di oltre 600KB di testo ad ogni verifica degli aggiornamenti con Apple. Ora l’intera operazione è svolta in modo super-efficiente e in un tempo praticamente impercettibile. Questo permette di rendere molto piu’ veloce la verifica degli aggiornamenti dei firmware con Apple (un grazie allo sviluppatore della libreria che uso per averla aggiornata in modo da risolvere il mio problema , dopo averlo contattato via email, da solo non ci sarei mai riuscito!!!).</li>\n<li>Corretto GRAVISSIMO bug durante l’avvio e di conseguenza non avviene più nessuna scrittura superflua sul disco. </li>\n<li>CORRETTO GRAVE BUG CHE IMPEDIVA L’AUTO-AGGIORNAMENTO DEL PROGRAMMA</li>\n<li>Corretto bug nella gestione del pulsante per verificare gli aggiornamenti software</li>\n<li>Corretto bug su abilitazione/disabilitazione delle voci nel menu help: agg software e agg database</li>\n<li>Corretto problema nella generazione dei path sul disco per i pc con la partizione di sistema diversa da “C” (windows)</li>\n</ul>\n\n<h5>0.5.0.0 - 03/19/2012</h5>\n\n<p>Changelog 0.5.0.0 FINALE (news rispetto la RC2): </p>\n\n<ul>\n<li>Testato per bene il sistema di autoaggiornamento database e del programma</li>\n<li>Migliorato il menu del programma con una divisione delle voci più intelligente</li>\n<li>Messaggi nella splashscreen tradotti in inglese e italiano</li>\n<li>Aggiunta traduzione inglese sui nuovi componenti della gui</li>\n</ul>\n\n<p>Changelog 0.5.0 RC2:</p>\n\n<ul>\n<li>Corretto grave bug nell'aggiornamento delle versioni di iTunes perche' non caricava il db aggiornato all'avvio, ma quello precedente. In realta' mancava un sacco di codice per questa parte :) errore mio XD.</li>\n<li>Corretto grave bug nell'aggiornamento delle preferenze, sembrava risolto ma e' tornato ancora :) Ora spero di averlo rimosso.</li>\n</ul>\n\n<p>Changelog 0.5.0 RC1:</p>\n\n<ul>\n<li>Aggiunto download versioni di iTunes e preparato gia' per i tool per il Jailbreak</li>\n<li>Aggiunto sistema di autoaggiornamento delle versioni di iTunes direttamente dal server Apple.</li>\n<li>Il database usato dal programma e' ora compresso per dimezzarne la dimensione. Questo porta alla novita' seguente...</li>\n<li>Ridotto il consumo di banda (internet) durante l'avvio del programma (AD OGNI AVVIO).</li>\n<li>Corretto grave bug nel sistema di aggiornamento delle preferenze (presente dalla 0.4.0 alla 0.5.0beta4 [non rilasciata al pubblico]).</li>\n<li>Funzionante \"update-db\" da linea di comando. Grazie ad esso e' possibile risolvere problemi sul caricamento del database al momento dell'avvio in tutta semplicità. Questo comando rimuove i database esistenti e scarica le versioni piu' recenti dal server, dopodiche' cerca anche di aggiornarli contattando Apple. Terminato il processo, il software viene chiuso e al riavvio (normale con doppio clic) avrai i database aggiornati.</li>\n<li>Corretto il bug: \"se 4 i temp file vengono rinominati manualmente o a causa di un problema in BYAM e poi avvio il prog, lui giustamente non li carica, ma non li rimuove nemmeno, sia nel caso in cui il download sia incompleto sia nel caso fosse terminato. Ovviamente, se il firmware non puo' essere trovato, i sui part non servono e devono essere rimossi.\"</li>\n<li>Corretto il bug: \"Se per errore il file .sha si trova in temp al prossimo riavvio veniva cancellato, ora invece viene spostato tra i download ed appare una richiesta all'utente su che fare\"</li>\n<li>Rivisto il pannello delle impostazioni con la possibilita' di personalizzare le notifiche e inserire i valori per il Proxy</li>\n<li>Separati i file delle traduzioni tra normale, preferenze e messaggi di notifica.</li>\n<li>GUI separata dalla logica del programma per il 50%, il processo, lento e complicato richiedera' del tempo per essere perfezionato</li>\n<li>Cambiato ordine dei firmware, dal piu' recente al piu' vecchio</li>\n<li>Cambiato ordine dispositivi in modo piu' intelligente e aggiunti nuovi nomi commerciali AppleTV3 e iPad3</li>\n<li>Creato messaggio con spunta che avvisa alla prima riduzione ad icona</li>\n<li>Aggiunto il supporto ad ArchLinux 2011 (ultmi update con kernel 3.1.x.x) sia con KDE sia con Gnome</li>\n<li>Ora si puo' rinizializzare il programma anche durante la fase di aggiornamento del database</li>\n<li>Aggiunte le icone di itunes nella tabella</li>\n<li>Cambiate alcune scritte nella splashscreen </li>\n<li>Corretti bug minori</li>\n<li>Ottimizzazione di alcune procedure e migliorato il codice per renderlo + facile da aggiornare in futuro</li>\n</ul>\n\n<h5>0.4.0 - 01/06/2012</h5>\n\n<p>CHANGELOG </p>\n\n<ul>\n<li>Ora il programma si chiamerà BYAManager 0.4.0 e non più beta4, visto che questa versione non merita il nome beta, dopotutto è stabile.</li>\n<li>Aggiunta la spashScreen prima dell'avvio dell'interfaccia grafica del programma</li>\n<li>RISOLTO IMPORTANTISSIMO BUG NEL SISTEMA DI AUTOAGGIORNAMENTO DEL DATABASE DEI FIRMWARE E DIVERSE NOVITA' PER RENDERLO ANCORA PIU' AUTOMATIZZATO </li>\n<li>CON LA  0.4.0, DOPO AVERLO SCARICATO, IL NUMERO DI RIAVVI PER INSTALLARE IL NUOVO DATABASE SI E' RIDOTTO DRASTICAMENTE, ORA FA TUTTO LUI ECCETTO UN CASO PARTICOLARE CHE NON SI PUO' EVITARE (POCHI MINUTI/ORE DOPO L'USCITA DI NUOVI FIRMWARE/DISPOSITIVI).</li>\n<li>RIABILITATI GLI AUTOAGGIORNAMETI (IN BETA 3 HO DISATTIVATO TUTTO) PER LE VERSIONI SUPERIORI ALLA 0.4.0 (SISTEMA 1000 VOLTE PIU' SICURO RISPETTO QUELLO USATO PRIMA DELLA BETA3) </li>\n<li>Interrompendo download al 99% durante unione delle 4 parti, al riavvio il processo continua correttamente, a differenza della beta3</li>\n<li>Interrompendo download al 99% durante la validation, al riavvio il processo viene verificato chiedendo all'utente cosa fare</li>\n<li>Cambiati i nomi commerciali aggiungendo gli spazi e la scritta \"touch\" con la G su consiglio di Filippo Rossi di BYAStaff</li>\n<li>Il pannello preferenze non manda + i download in pausa nemmeno modificando le impostazioni, perchè esse saranno applicate al riavvio</li>\n<li>Ora si puo' cambiare il percorso dei download e poi continuare a scaricare nella cartella prima del cambiamento senza problemi per poter far si che le modifiche abbiamo effetto bisogna per forza riavviare il programma.</li>\n<li>Pannello delle preferenze completamente rivisto e gestito in modo differente e migliore.</li>\n<li>Si puo' cambiare il percorso di download scrivendo direttamente nel campo di testo nel pannello preferenze</li>\n<li>Su OSX ora appare il nome di BYAManager nella barra in alto e non + logica.main</li>\n<li>Corretto bug grafico nella toolbar che causava la rimozione dell'effetto arrotondato</li>\n<li>Ora i testi presenti nei pulsanti verdi e personalizzati appaiono ben centrati</li>\n<li>Modificato e ottimizzato il sistema di gestione dei pulsanti della toolbar (risolto un bug su windows7 che causava un comportamento anomalo nella versione prebeta3 rilasciata solo allo staff di BYA. Per nasconderlo temporaneamente avevo adottato una tecnica folle che richiedeva troppe risorse)</li>\n<li>Rimosso i pulsanti STOP e anche la riga nel popup sulla tabella. Ora un pulsante ferma e rimuove automaticamente, tutto in uno</li>\n<li>Rimosse diverse immagini presenti nel programma che gestivano lo stato STOP, riducendo la dimensione del file jar</li>\n<li>Aggiunta la traduzione in ceco inviatami da un utente</li>\n<li>Durante la fase di validation non si può più mettere in pausa o cancellare un download (come giusto che sia)</li>\n<li>Cambiamenti alle colonne della tabella (IMPORTANTE per i prossimi aggiornamenti), tra cui: la versione di iOS e la build sono integrate nella stessa colonna \"versione\" e dispositivo e' sostituito da \"tipo\".</li>\n<li>Aggiunta voce per ridurre ad icona il programma nel menu file</li>\n<li>Corretto bug nella gestione del Logger</li>\n<li>Corretti altri bug grafici minori e poco visibili</li>\n<li>Corretti altri bug funzionali minori</li>\n</ul>\n\n<h5>Beta 3 - 12/28/2011</h5>\n\n<ul>\n<li>AGGIUNTA l'interfaccia grafica in stile BYA e riposizionati molti elementi (cambiata la textfield nelle impostazioni con un menu a tendina e personalizzato ogni elemento grafico).</li>\n<li>AGGIUNTA la velocità globale di download (somma delle velocità di ogni singolo download ed aggiornata ogni secondo).</li>\n<li>AGGIUNTA la compatibilità con JAVA 7</li>\n<li>AGGIUNTA la possibilità di inviare comandi via terminale per avviare il programma secondo diverse modalità, proprio come in redSn0w (utile per risolvere problemi di avvio e per reinizializzare/aggiornare il programma)</li>\n<li>OTTIMIZZAZIONE dell'intero programma e di alcune procedure di ricerca</li>\n<li>RIMOSSA (momentaneamente) la splash screen in attesa di una versione migliore</li>\n<li>AGGIUNTA la doppia lingua in base a quella dell'OS (italiano, inglese)</li>\n<li>MIGLIORATO il sistema di autoaggiornamento</li>\n<li>CORRETTO bug gravissimo che causava consumi spropositati di CPU...ora si attesta tra l'8 e il 20% con tantissimi download ;) direi che è perfetto.</li>\n<li>INTERAMENTE riscritto il sistema di Download per supportare connessioni contemporanee thread-safe aumentando di un centinaio di volte le prestazioni e riducendo moltissimi tempi di attesa non giustificati.</li>\n<li>INTERAMENTE rivisto il codice di tutto il programma (usando ove possibile i Design Pattern), ottimizzazione spinta tanto da ridurre di ben 30MB il consumo della RAM, pulendo/semplificando anche il codice e permettendomi di aggiornarlo e modificarlo più velocemente.</li>\n<li>Rivisto il progetto del programma per aumentare la riusabilita', preparandomi per il riciclo del codice nel caso sviluppassi un nuovo progetto per BYA.</li>\n<li>INTERAMENTE riscritto il sistema per calcolare velocità, tempo rimanente e data fine che ora avviene nello stesso istante (ogni secondo) per tutti i download in lista permettendo di stimare facilmente la velocità globale senza commettere errori eccessivi. Questo novità porta con sè un'enorme ottimizzazione della RAM usata, infatti ora vengono risparmiati più di 10 MB semplicemente riscrivendo questa piccola, ma importantissima, funzione. C'è ancora lavoro da fare per ridurre gli sprechi, ma per ora è più che accettabile XD.</li>\n<li>Corretto il bug presente nelle versioni alpha8, alpha9, beta1 e beta2 che causava un \"lampeggio\" della tabella quando si cancellava un download completato e sopra di esso ve ne era un altro completato (senza altri in stati differenti). C'è voluto un sacco ma finalmente ho trovato il difetto, bastava aggiungere una sola riga di codice per correggerlo ;)</li>\n<li>Diversi bug (ALCUNI RILEVANTI) corretti in tutto il programma</li>\n<li>PULIZIA del codice e miglioramenti vari</li>\n<li>Possibilità di scegliere come visualizzare la dimensione dei file nella tabella tra Byte, Multipli del Byte (tiene conto del fattore 1000) [PREDEFINITO per comodità] o Multipli del Binary Byte (tiene conto del fattore 1024). Quindi, aggiunto menu' a tendina del pannello delle preferenze.</li>\n</ul>\n\n<h5>Beta 2 - 10/24/2011</h5>\n\n<ul>\n<li>Migliorata la grafica aggiungendo icone nella tabella, riducendo la dimensione della toolbar (impedendone anche lo spostamento), riprogrettando il pannello impostazioni con l'uso di schede.</li>\n<li>Dimensione del download nella tabella non viene mostrata in byte ma in KB, MB o GB. E' comunque possibile ripristinare la visione precedente tramite il pannello \"impostazioni\" e riavviando il programma.</li>\n<li>Su mac OSX ora l'app nella dock appare con l'icona corretta e col nome giusto</li>\n<li>Aggiunta la data di ultimo aggiornamento database</li>\n<li>Completamente rivisito e corretto il sistema di aggiornamento database automatico ogni 24ore o manuale cliccando sul pulsante apposito...ora funziona e non presenta più i bug riscontrati nella versione beta1 con l'uscita di iOS5</li>\n<li>Il sistema di auto-aggiornamento ora verificherà anche la correttezza dell'updater e della nuova versione del programma tramite SHA, per evitare di eseguire applicazioni pericolose.</li>\n<li>Moltissimi bugfix in tutto il programma e in tutte le funzionalità</li>\n<li>Migliorate le prestazioni</li>\n<li>Inserito sistema totalmente anonimo per scopi statistici sull'uso del programma</li>\n<li>e altre modifiche che ora non mi vengono in mente ma che ci sono di certo... XD</li>\n</ul>", 
    "releases" : "<ul>\n<li>04/11/2015 - <b>BYAManager 1.0.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v1.0.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-100.html\">HERE</a></li>\n<li>04/10/2015 - <b>BYAManager 0.9.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.9.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-090.html\">HERE</a></li>\n<li>04/06/2015 - <b>BYAManager 0.8.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.8.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-080.html\">HERE</a></li>\n<li>04/03/2015 - <b>BYAManager 0.7.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.7.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-070.html\">HERE</a></li>\n<li>04/02/2015 - <b>BYAManager 0.6.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.6.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/bya-manager-060.html\">HERE</a></li>\n<li>03/30/2015 - <b>BYAManager 0.5.6</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.6\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/byamanager-056.html\">HERE</a> </li>\n<li>03/29/2015 - <b>BYAManager 0.5.5</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.5\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/changelog-0.html\">HERE</a></li>\n<li>10/21/2014 - <b>BYAManager 0.5.4</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/10/changelog-0.html\">HERE</a></li>\n<li>09/29/2014 - <b>BYAManager 0.5.3</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/09/byamanager-053.html\">HERE</a><br></li>\n<li>04/06/2012 - <b>BYAManager 0.5.2</b> public <a href=\"http://www.biteyourapple.net/2012/05/12/esclusiva-bya-bya-manager-0-5-2/#more-43579\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/04/anteprima-byamanager-052.html\">HERE</a></li>\n<li>04/05/2012 - <b>BYAManager 0.5.2 RC1</b> public via Twitter and auto-update</li>\n<li>03/28/2012 - <b>BYAManager 0.5.1</b> public <a href=\"http://www.biteyourapple.net/2012/04/06/esclusiva-bya-bya-manager-0-5-1/#more-43275\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/03/anteprima-byamanager-051.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0.0</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-050.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC2</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC1</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 beta 1</b> only for 3 beta testers</li>\n<li>03/13/2012 - <b>BYAManager 0.5.0.0 Beta5</b> only for beta testers</li>\n<li>03/09/2012 - <b>BYAManager 0.5.0.0 Beta3</b> only for beta testers </li>\n<li>02/24/2012 - <b>BYAManager 0.4.1.0 (or 0.5.0.0 Beta2)</b> only for beta testers</li>\n<li>01/06/2012 - <b>BYAManager 0.4.0 (or Beta 4)</b> public <a href=\"http://www.biteyourapple.net/2012/01/06/esclusiva-bya-biteyourapple-manager-0-4-0/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-beta4.html\">HERE</a></li>\n<li>12/28/2011 - <b>BYAManager Beta 3</b> public <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta3-preview.html\">HERE</a></li>\n<li>10/24/2011 - <b>BYAManager Beta 2</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta2.html\">HERE</a> </li>\n<li>10/10/2011 - <b>BYAManager Beta 1</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta1.html\">HERE</a></li>\n<li>10/03/2011 - <b>BYAManager Beta 0.3</b> private</li>\n<li>08/04/2011 - <b>BYAManager Alpha 4</b> private</li>\n<li>07/31/2011 - <b>BYAManager Alpha 3</b> private</li>\n</ul>", 
    "features" : "<h4>You can:</h4>\n\n<ul>\n<li>download files via http and https, also with BYAManager in background (minimized)</li>\n<li>download one or more files at the same time at full speed (Download Accelerator), with multiple processes to bypass server's limitations</li>\n<li>play/pause/stop/cancel downloads, using a list of available iOS Firmware and iTunes versions in a local database</li>\n<li>enable/disable sha1 check (enabled by default)</li>\n<li>search new BYAManager's versions or new database's versions</li>\n<li>change settings, for example: path of the download folder, proxy, measurement unit, language, buffer size, notifications, and so on</li>\n<li>restore settings to default values</li>\n<li>open the download folder, directly from BYAManager</li>\n<li>re-download files in the list directly in the browser, or in other programs</li>\n<li>control some important features running BYAManager via Command Line with a complete tutorial executing \"BYAManager.jar help\"</li>\n<li>move a completed download into the iTunes folder (only on Mac and Windows) to be able to update/restore your device from iTunes without re-download the file \".ipsw\".</li>\n</ul>\n\n<h4>BYAManager:</h4>\n\n<ul>\n<li>checks and updates itself automatically every 24 hours, with BYAUpdater</li>\n<li>checks and updates automatically the databse every 24 hours</li>\n<li>downloads files at full speed using multiple process</li>\n<li>checks the integrity os a file with hash algoririthm (SHA1).</li>\n<li>tries to restore incompleted/damaged files, during the startup of the program</li>\n<li>checks if a file has been downloaded before</li>\n<li>logs every actions in a file called BYAManager.log, near the executable</li>\n</ul>", 
    "futureExtensions" : "<h4>Functionalities</h4>\n\n<ul>\n<li>Add a pattern to the sha check </li>\n<li>Improve the logic to check the free space on the disk</li>\n<li>Dinamically update the list of available firmwares and iTunes versions, without the requirement of \"restart BYAManager to apply\".</li>\n<li>Add social networks integration: Twitter, Facebook and so on</li>\n</ul>\n\n<h4>GUI</h4>\n\n<ul>\n<li>Create a new modern GUI to release BYAManager 2.0 (NOT IN SWING, but with other frameworks, like JavaFX)</li>\n<li>Create a custom GUI for the popup in the system tray</li>\n<li>Add in the GUI some informations to help the user to understand the state of every process</li>\n<li>Add the donate button in the GUI</li>\n</ul>", 
    "licenseText" : "<p>Copyright 2011-2015 Stefano Cappa</p>\n\n<p>Licensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at</p>\n\nhttp://www.apache.org/licenses/LICENSE-2.0\n\n<p>Unless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.</p>\n\n<p><br>\n<b>Created by Stefano Cappa</b></p>", 
    "license" : "apache-v2", 
    "visible" : true, 
    "lastUpdate" : ISODate("2013-07-15T22:00:00.000+0000"), 
    "gallery" : [
        {
            "thumb" : "assets/images/projects/spf/1.png", 
            "img" : "assets/images/projects/spf/1.png", 
            "description" : "Image 1"
        }, 
        {
            "thumb" : "assets/images/projects/spf/2.png", 
            "img" : "assets/images/projects/spf/2.png", 
            "description" : "Image 2"
        }
    ], 
    "projectHomeView" : {
        "carouselImagePath" : "http://placehold.it/1000x400", 
        "carouselText" : "sdjs fshfs fhfsdhf", 
        "thumbImagePath" : "http://placehold.it/720x300", 
        "thumbText" : "sfsfasf", 
        "bigThumbImagePath" : "http://placehold.it/500x500", 
        "bigThumbText" : "dasdasdas"
    }, 
    "authors" : [
        {
            "name" : "dasdasdas", 
            "surname" : "dsadasd", 
            "url" : "http://shjdjhdj", 
            "urlAvailable" : true
        }, 
        {
            "name" : "dsfdsgsdgd", 
            "surname" : "werewweggew", 
            "url" : "http://dsgwgewg", 
            "urlAvailable" : true
        }, 
        {
            "name" : "jiomdwqdqw", 
            "surname" : "iuytdgbpl,", 
            "url" : "http://mxiuwfybe", 
            "urlAvailable" : false
        }
    ]
}
{ 
    "_id" : ObjectId("57632b61009f08db1623b607"), 
    "name" : "Superapp", 
    "url" : "https://github.com/Ks89/superapp", 
    "iconPath" : "assets/images/projects/project_icons/superapp.png", 
    "shortDescription" : "dsffsduhfsduaf asfyhasfuas fy8shfuiqw fUWQHBFUIWEBQ fewhfuwfnoeiwb ewuhfiewn", 
    "tags" : [
        "java se", 
        "maven", 
        "university"
    ], 
    "description" : "BYAManager is a personal project that i realized in 2011 and updated more times during the years. It's a Multi-Platform and Multi-Language software dedicated to the \"Apple World\", that i developed for the blog called BiteYourApple.\nThis software is a GUI to download iOS firmwares and iTunes versions with some extra features.\nIt's legal, obviously, because all files are on Apple server. BYAManager gets files directly from Apple server to you.\n<br/>\nIt's available in 3 languages: ITALIAN, ENGLISH and CZECH\n<br/>\nThe entire list of features is available <a href=\"https://github.com/Ks89/BYAManager#features\">HERE</a>.\n<br/>\nBYAManager uses <a href=\"https://github.com/Ks89/BYAUpdater\">BYAUpdater</a> to update itself automatically!\n<br/>\nI presented this software in 2011 <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a>\n<br/>\nAttention!!! I started this project on assembla.com with SVN. The source code and the commit's list are in Assembla in a private repository. This isn't important, because the code here on GitHub is better.\n<br/>\nI'm working on a Python script to sort the ipsw's links in the database.\nThis project is available <a href=\"https://github.com/Ks89/BYAMSorter\">HERE</a>. \nIn the future, i want to integrate this script in BYAManager.\n<br/>\n<b>This software requires Java 8 or above and an internet connection</b>", 
    "changelog" : "<ul>\n<li>NUOVA FUNZIONE: aggiunto nuovo parametro eseguendo BYAManager tramite linea di comando. Comunque si tratta una funzione da utenti esperti e che serve più a me che ad altri ;)</li>\n<li>RISOLTO BUG MINORE: ultimo bug conosciuto da tempo, risolto. Cioè, forzando l'aggiornamento del db o del programma, l'interfaccia grafica non si congela più per qualche secondo. Ora non ne conosco di rilevanti.</li>\n</ul>\n\n<h5>0.9.0 - 10/04/2015</h5>\n\n<ul>\n<li>NUOVA FUNZIONE: ora se Apple rilascia un nuovo dispositivo, es Apple Watch, non dovrò far uscire un aggiornamento del programma (es la versione 0.9.1), ma mi basterà modificare i dati sul mio server, così magicamente, nei menu a tendina del programma, appariranno le scritte coi nomi commerciali di questi prodotti Apple (è comunque richiesto un riavvio, dopo la mia modifica, ovvio ;))</li>\n</ul>\n\n<h5>0.8.0 - 06/04/2015</h5>\n\n<ul>\n<li>PREMESSA: da diversi mesi Apple rilascia le versioni di iTunes anche con link https. Inoltre, ha fatto si che tutte le versioni di iTunes siano scaricabili con https. Infatti, ora si può scaricare tutte le versioni di iTunes sia tramite collegamento http, sia https. Quindi, è evidente che vada verso https.\nBYAManager non è stato pensato per supportare connessioni https, così ho dovuto estendere il programma e potenziare notevolmente il sistema di download.</li>\n<li>LA MIA SOLUZIONE: In questa versione ho aggiunto proprio la possibilità di scaricare file via https (per ora senza accelerazione dei download). Questa funzione è già abilitata, ma per una questione di sicurezza, cercherò di usare solo link http, fino a che Apple non rilascerà solo versioni con https. Fino a questo giorno, continuerò a migliorare la parte https, in preparazione di quel momento.\nPoiché non so quando avverrà quel momento, ho deciso di aggiungere il supporto e abilitarlo direttamente nella versione 0.8.0. Se apple rilascerà il nuovo iOS (magari per l'Apple Watch) o iTunes SOLO via https, non servirà aggiornare il programma, poiché l'ho già preparato per quel momento grazie alla versione 0.8.0.</li>\n</ul>\n\n<h5>0.7.0 - 03/04/2015</h5>\n\n<ul>\n<li>Nuovissimo sistema di logging, per creare il file BYAManager.log e portato anche su BYAUpdater.</li>\n<li>Aggiornamento librerie per il download dei file.</li>\n<li>Riabilitato il proxy HTTP nelle impostazioni (attenzione assicurasi di trovare un proxy a prestazioni elevate).</li>\n<li>Corretto bug che lanciava messaggio d'errore durante la reinizializzazione del programma. In realtà la funzionalità era ok, ma c'era un messaggio d'errore inutile.</li>\n</ul>\n\n<h5>0.6.0 - 02/04/2015</h5>\n\n<ul>\n<li>Definitivamente corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux e anche Windows, presente da anni. Ho cambiato proprio il metodo per farlo, usando le nuove funzioni di java.</li>\n<li>Miglioramento generale delle performance nel processo di download.</li>\n<li>Completamente rifatto il sistema di connessione al server.</li>\n<li>Completamente rivisto il sistema per il download dei firmware e itunes. Ora è più facile da estendere per riabilitare i proxy, nella 0.7.0.</li>\n</ul>\n\n<h5>0.5.6 - 03/30/2015</h5>\n\n<ul>\n<li>Corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux, presente da anni.</li>\n<li>NOTA BENE per gli utenti Windows: assicuratevi di eseguire BYAManager.jar da una cartella in cui nel percorso non appaiono spazi. E' un bug che ho corretto per MAC OSX e LINUX, mentre per Windows ci vuole ancora un po' di pazienza. Devo trovare un attimo libero e lo correggo facilmente.</li>\n</ul>\n\n<h5>0.5.5 - 03/29/2015</h5>\n\n<ul>\n<li>Cambiamento del server che gestisce gli aggiornamenti. Non avendo più il precedente, tutte le versioni di questo programma (prima della 0.5.5) non sono più supportate, sia nel funzionamento, sia negli aggiornamenti. </li>\n<li>Aggiornate dipendenze varie di librerie usate internamente.</li>\n</ul>\n\n<h5>0.5.4 - 10/21/2014</h5>\n\n<ul>\n<li>Aggiornato ai nuovi dispositivi</li>\n</ul>\n\n<h5>0.5.3 - 09/29/2014</h5>\n\n<ul>\n<li>Versione uscita dopo più di 2 anni di attesa per rendere di nuovo funzionante il programma.</li>\n<li>Aggiunti nuovi dispositivi e database</li>\n<li>Richiede Java 8 o superiore</li>\n<li>Aggiornate tutte le librerie interne</li>\n<li>Attenzione: l'auto-aggiornamento di itunes non va perchè semplicemente apple cambia metodo ogni 2 secondi ed è impossibile fare un sistema davvero efficace. Invece, quello dei firmware non ha mai avuto problemi in anni e anni XD</li>\n</ul>\n\n<h5>0.5.2 - 04/06/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>La colonna della tabella chiamata \"Versione\" non ha piu' nessun logo a fianco. Il logo del file ipsw e' stato spostato nella prima colonna, nel caso in download sia di un firmware.</li>\n<li>Aggiunti i pulsanti per eseguire le azioni di spostamento ed esecuzione</li>\n<li>Aggiunta la voce nel popup (prima era chiamata COMING SOON) per disabilitare il controllo della sha1</li>\n</ul>\n\n<p>NOVITA’ IN FUNZIONALITA'</p>\n\n<ul>\n<li>Comando update-software finalmente completato e funzionante (in realta' andava anche nella 0.5.1 :) anche se con alcuni possibili errori)</li>\n<li>Cliccando col tasto destro su una riga della tabella (con un download in corso o in pausa) si puo' scegliere se disabilitare la verifica della SHA1 al termine del download. Questa procedura (verifica dell'hash tramite algoritmo sha1, identificata dall'icona fucsia col punto esclamativo) assicura la correttezza del file scaricato, ma potrebbe richiedere del tempo ( a volta anche un minuto) e un notevole spreco di risorse. Vista la crescente affidabilita' del programma, ho deciso di dare all'utente la possibilita' di disabilitare la procedura per ottenere il file desiderato piu' rapidamente.</li>\n<li>Aggiunta tutta la logica per gestire le azioni di esecuzione e spostamento dei download termimati</li>\n<li>Aggiunto GOD BETA1 (Guardian of download) per tenere sotto controllo i download, la loro velocita' e il fatto che alcuni processi non si blocchino senza motivo</li>\n</ul>\n\n<h5>0.5.1 - 03/28/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>Rimosso il limite di ridimensionamento dello sfondo della finestra del programma per risoluzioni superiori a 1920x<strong><em>. - Infatti, fino ad ora, la finestra principale del programma mostrava lo sfondo con una dimensione massima di 1920x</em></strong>, con quelle superiori appariva lo sfondo grigio. Ora non accade più. Adesso lo sfondo viene disegnato in modo molto piu’ efficiente.</li>\n<li>Rifatte le icone download, validation ecc… nella tabella</li>\n<li>Aggiunti i bordi nei popupmenu (come il menu file, help ecc…in alto oppure quello che appare cliccando col tasto destro su un download nella tabella) e migliorati i “separator” tra gli elementi di questi menu.</li>\n<li>Aggiunta voce nel popupmenu della tabella chiamata “coming soon”, che in futuro sara’ sostituita dalla reale funzione </li>\n<li>Ora la velocità globale non appare più come “0″, ma se è 0 perchè i download sono fermi o non ce ne sono non appare nulla (vuoto)</li>\n<li>La finestra preferenze appare a centro schermo e da ora se dovessi modificare la dimensione predefinita di una finestra il posizionamento al centro avviene in automatico (cosi’ evito i problemi col pannello delle preferenze).</li>\n<li>Migliorata SplashScreen per adattarla meglio alla grafica del programma</li>\n<li>Cambiata dimensione predefinita del programma (+ lungo) e ricentrata.</li>\n<li>Aggiunto autoridimensionamento delle colonne della tabella (ancora da perfezionare)</li>\n<li>Nella colonna della velocita’ ora non appare nulla se il download e’ in pausa (velocita’ ==0)</li>\n<li>Colonna “ora fine” rimossa e migliorata quella del tempo rimanente che ora dice h, m e s in modo preciso.</li>\n</ul>\n\n<p>NOVITA’ GENERICHE</p>\n\n<ul>\n<li>Praticamente riscritta la gestione della GUI per essere piu’ adattabile.</li>\n<li>Aggiornamento delle librerie di terze parti</li>\n<li>Aggiunto comando update-software, ma ancora in beta e non provato in caso di aggiornamento reale</li>\n<li>La fase di verifica nuove versioni software non richiede piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>La fase di verifica corretteza file JAR durante un agg software non richiedono piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>Pulizia ed ottimizzazione del codice.</li>\n<li>Aggiunta suddivisione tra stati merging e validation. Il primo avviene sempre alla fine di ogni download (identificato dal simbolo +) e consiste nell’unire i vari file part che compongono il download per fornire il file desiderato. Il secondo può avvenire dopo al merging (per ora è sempre obbligatorio, nella 0.6.0 non lo sarà più) e consiste nel verificare tramite l’algoritmo SHA1 la correttezza del file scaricato. Questo metodo è lo stesso che consiglia Apple e che anche iTunes, probabilmente, esegue.</li>\n</ul>\n\n<p>CORREZIONE BUG (BUGFIX)</p>\n\n<ul>\n<li>Rimossa una lettura+scrittura di un file di oltre 600KB di testo ad ogni verifica degli aggiornamenti con Apple. Ora l’intera operazione è svolta in modo super-efficiente e in un tempo praticamente impercettibile. Questo permette di rendere molto piu’ veloce la verifica degli aggiornamenti dei firmware con Apple (un grazie allo sviluppatore della libreria che uso per averla aggiornata in modo da risolvere il mio problema , dopo averlo contattato via email, da solo non ci sarei mai riuscito!!!).</li>\n<li>Corretto GRAVISSIMO bug durante l’avvio e di conseguenza non avviene più nessuna scrittura superflua sul disco. </li>\n<li>CORRETTO GRAVE BUG CHE IMPEDIVA L’AUTO-AGGIORNAMENTO DEL PROGRAMMA</li>\n<li>Corretto bug nella gestione del pulsante per verificare gli aggiornamenti software</li>\n<li>Corretto bug su abilitazione/disabilitazione delle voci nel menu help: agg software e agg database</li>\n<li>Corretto problema nella generazione dei path sul disco per i pc con la partizione di sistema diversa da “C” (windows)</li>\n</ul>\n\n<h5>0.5.0.0 - 03/19/2012</h5>\n\n<p>Changelog 0.5.0.0 FINALE (news rispetto la RC2): </p>\n\n<ul>\n<li>Testato per bene il sistema di autoaggiornamento database e del programma</li>\n<li>Migliorato il menu del programma con una divisione delle voci più intelligente</li>\n<li>Messaggi nella splashscreen tradotti in inglese e italiano</li>\n<li>Aggiunta traduzione inglese sui nuovi componenti della gui</li>\n</ul>\n\n<p>Changelog 0.5.0 RC2:</p>\n\n<ul>\n<li>Corretto grave bug nell'aggiornamento delle versioni di iTunes perche' non caricava il db aggiornato all'avvio, ma quello precedente. In realta' mancava un sacco di codice per questa parte :) errore mio XD.</li>\n<li>Corretto grave bug nell'aggiornamento delle preferenze, sembrava risolto ma e' tornato ancora :) Ora spero di averlo rimosso.</li>\n</ul>\n\n<p>Changelog 0.5.0 RC1:</p>\n\n<ul>\n<li>Aggiunto download versioni di iTunes e preparato gia' per i tool per il Jailbreak</li>\n<li>Aggiunto sistema di autoaggiornamento delle versioni di iTunes direttamente dal server Apple.</li>\n<li>Il database usato dal programma e' ora compresso per dimezzarne la dimensione. Questo porta alla novita' seguente...</li>\n<li>Ridotto il consumo di banda (internet) durante l'avvio del programma (AD OGNI AVVIO).</li>\n<li>Corretto grave bug nel sistema di aggiornamento delle preferenze (presente dalla 0.4.0 alla 0.5.0beta4 [non rilasciata al pubblico]).</li>\n<li>Funzionante \"update-db\" da linea di comando. Grazie ad esso e' possibile risolvere problemi sul caricamento del database al momento dell'avvio in tutta semplicità. Questo comando rimuove i database esistenti e scarica le versioni piu' recenti dal server, dopodiche' cerca anche di aggiornarli contattando Apple. Terminato il processo, il software viene chiuso e al riavvio (normale con doppio clic) avrai i database aggiornati.</li>\n<li>Corretto il bug: \"se 4 i temp file vengono rinominati manualmente o a causa di un problema in BYAM e poi avvio il prog, lui giustamente non li carica, ma non li rimuove nemmeno, sia nel caso in cui il download sia incompleto sia nel caso fosse terminato. Ovviamente, se il firmware non puo' essere trovato, i sui part non servono e devono essere rimossi.\"</li>\n<li>Corretto il bug: \"Se per errore il file .sha si trova in temp al prossimo riavvio veniva cancellato, ora invece viene spostato tra i download ed appare una richiesta all'utente su che fare\"</li>\n<li>Rivisto il pannello delle impostazioni con la possibilita' di personalizzare le notifiche e inserire i valori per il Proxy</li>\n<li>Separati i file delle traduzioni tra normale, preferenze e messaggi di notifica.</li>\n<li>GUI separata dalla logica del programma per il 50%, il processo, lento e complicato richiedera' del tempo per essere perfezionato</li>\n<li>Cambiato ordine dei firmware, dal piu' recente al piu' vecchio</li>\n<li>Cambiato ordine dispositivi in modo piu' intelligente e aggiunti nuovi nomi commerciali AppleTV3 e iPad3</li>\n<li>Creato messaggio con spunta che avvisa alla prima riduzione ad icona</li>\n<li>Aggiunto il supporto ad ArchLinux 2011 (ultmi update con kernel 3.1.x.x) sia con KDE sia con Gnome</li>\n<li>Ora si puo' rinizializzare il programma anche durante la fase di aggiornamento del database</li>\n<li>Aggiunte le icone di itunes nella tabella</li>\n<li>Cambiate alcune scritte nella splashscreen </li>\n<li>Corretti bug minori</li>\n<li>Ottimizzazione di alcune procedure e migliorato il codice per renderlo + facile da aggiornare in futuro</li>\n</ul>\n\n<h5>0.4.0 - 01/06/2012</h5>\n\n<p>CHANGELOG </p>\n\n<ul>\n<li>Ora il programma si chiamerà BYAManager 0.4.0 e non più beta4, visto che questa versione non merita il nome beta, dopotutto è stabile.</li>\n<li>Aggiunta la spashScreen prima dell'avvio dell'interfaccia grafica del programma</li>\n<li>RISOLTO IMPORTANTISSIMO BUG NEL SISTEMA DI AUTOAGGIORNAMENTO DEL DATABASE DEI FIRMWARE E DIVERSE NOVITA' PER RENDERLO ANCORA PIU' AUTOMATIZZATO </li>\n<li>CON LA  0.4.0, DOPO AVERLO SCARICATO, IL NUMERO DI RIAVVI PER INSTALLARE IL NUOVO DATABASE SI E' RIDOTTO DRASTICAMENTE, ORA FA TUTTO LUI ECCETTO UN CASO PARTICOLARE CHE NON SI PUO' EVITARE (POCHI MINUTI/ORE DOPO L'USCITA DI NUOVI FIRMWARE/DISPOSITIVI).</li>\n<li>RIABILITATI GLI AUTOAGGIORNAMETI (IN BETA 3 HO DISATTIVATO TUTTO) PER LE VERSIONI SUPERIORI ALLA 0.4.0 (SISTEMA 1000 VOLTE PIU' SICURO RISPETTO QUELLO USATO PRIMA DELLA BETA3) </li>\n<li>Interrompendo download al 99% durante unione delle 4 parti, al riavvio il processo continua correttamente, a differenza della beta3</li>\n<li>Interrompendo download al 99% durante la validation, al riavvio il processo viene verificato chiedendo all'utente cosa fare</li>\n<li>Cambiati i nomi commerciali aggiungendo gli spazi e la scritta \"touch\" con la G su consiglio di Filippo Rossi di BYAStaff</li>\n<li>Il pannello preferenze non manda + i download in pausa nemmeno modificando le impostazioni, perchè esse saranno applicate al riavvio</li>\n<li>Ora si puo' cambiare il percorso dei download e poi continuare a scaricare nella cartella prima del cambiamento senza problemi per poter far si che le modifiche abbiamo effetto bisogna per forza riavviare il programma.</li>\n<li>Pannello delle preferenze completamente rivisto e gestito in modo differente e migliore.</li>\n<li>Si puo' cambiare il percorso di download scrivendo direttamente nel campo di testo nel pannello preferenze</li>\n<li>Su OSX ora appare il nome di BYAManager nella barra in alto e non + logica.main</li>\n<li>Corretto bug grafico nella toolbar che causava la rimozione dell'effetto arrotondato</li>\n<li>Ora i testi presenti nei pulsanti verdi e personalizzati appaiono ben centrati</li>\n<li>Modificato e ottimizzato il sistema di gestione dei pulsanti della toolbar (risolto un bug su windows7 che causava un comportamento anomalo nella versione prebeta3 rilasciata solo allo staff di BYA. Per nasconderlo temporaneamente avevo adottato una tecnica folle che richiedeva troppe risorse)</li>\n<li>Rimosso i pulsanti STOP e anche la riga nel popup sulla tabella. Ora un pulsante ferma e rimuove automaticamente, tutto in uno</li>\n<li>Rimosse diverse immagini presenti nel programma che gestivano lo stato STOP, riducendo la dimensione del file jar</li>\n<li>Aggiunta la traduzione in ceco inviatami da un utente</li>\n<li>Durante la fase di validation non si può più mettere in pausa o cancellare un download (come giusto che sia)</li>\n<li>Cambiamenti alle colonne della tabella (IMPORTANTE per i prossimi aggiornamenti), tra cui: la versione di iOS e la build sono integrate nella stessa colonna \"versione\" e dispositivo e' sostituito da \"tipo\".</li>\n<li>Aggiunta voce per ridurre ad icona il programma nel menu file</li>\n<li>Corretto bug nella gestione del Logger</li>\n<li>Corretti altri bug grafici minori e poco visibili</li>\n<li>Corretti altri bug funzionali minori</li>\n</ul>\n\n<h5>Beta 3 - 12/28/2011</h5>\n\n<ul>\n<li>AGGIUNTA l'interfaccia grafica in stile BYA e riposizionati molti elementi (cambiata la textfield nelle impostazioni con un menu a tendina e personalizzato ogni elemento grafico).</li>\n<li>AGGIUNTA la velocità globale di download (somma delle velocità di ogni singolo download ed aggiornata ogni secondo).</li>\n<li>AGGIUNTA la compatibilità con JAVA 7</li>\n<li>AGGIUNTA la possibilità di inviare comandi via terminale per avviare il programma secondo diverse modalità, proprio come in redSn0w (utile per risolvere problemi di avvio e per reinizializzare/aggiornare il programma)</li>\n<li>OTTIMIZZAZIONE dell'intero programma e di alcune procedure di ricerca</li>\n<li>RIMOSSA (momentaneamente) la splash screen in attesa di una versione migliore</li>\n<li>AGGIUNTA la doppia lingua in base a quella dell'OS (italiano, inglese)</li>\n<li>MIGLIORATO il sistema di autoaggiornamento</li>\n<li>CORRETTO bug gravissimo che causava consumi spropositati di CPU...ora si attesta tra l'8 e il 20% con tantissimi download ;) direi che è perfetto.</li>\n<li>INTERAMENTE riscritto il sistema di Download per supportare connessioni contemporanee thread-safe aumentando di un centinaio di volte le prestazioni e riducendo moltissimi tempi di attesa non giustificati.</li>\n<li>INTERAMENTE rivisto il codice di tutto il programma (usando ove possibile i Design Pattern), ottimizzazione spinta tanto da ridurre di ben 30MB il consumo della RAM, pulendo/semplificando anche il codice e permettendomi di aggiornarlo e modificarlo più velocemente.</li>\n<li>Rivisto il progetto del programma per aumentare la riusabilita', preparandomi per il riciclo del codice nel caso sviluppassi un nuovo progetto per BYA.</li>\n<li>INTERAMENTE riscritto il sistema per calcolare velocità, tempo rimanente e data fine che ora avviene nello stesso istante (ogni secondo) per tutti i download in lista permettendo di stimare facilmente la velocità globale senza commettere errori eccessivi. Questo novità porta con sè un'enorme ottimizzazione della RAM usata, infatti ora vengono risparmiati più di 10 MB semplicemente riscrivendo questa piccola, ma importantissima, funzione. C'è ancora lavoro da fare per ridurre gli sprechi, ma per ora è più che accettabile XD.</li>\n<li>Corretto il bug presente nelle versioni alpha8, alpha9, beta1 e beta2 che causava un \"lampeggio\" della tabella quando si cancellava un download completato e sopra di esso ve ne era un altro completato (senza altri in stati differenti). C'è voluto un sacco ma finalmente ho trovato il difetto, bastava aggiungere una sola riga di codice per correggerlo ;)</li>\n<li>Diversi bug (ALCUNI RILEVANTI) corretti in tutto il programma</li>\n<li>PULIZIA del codice e miglioramenti vari</li>\n<li>Possibilità di scegliere come visualizzare la dimensione dei file nella tabella tra Byte, Multipli del Byte (tiene conto del fattore 1000) [PREDEFINITO per comodità] o Multipli del Binary Byte (tiene conto del fattore 1024). Quindi, aggiunto menu' a tendina del pannello delle preferenze.</li>\n</ul>\n\n<h5>Beta 2 - 10/24/2011</h5>\n\n<ul>\n<li>Migliorata la grafica aggiungendo icone nella tabella, riducendo la dimensione della toolbar (impedendone anche lo spostamento), riprogrettando il pannello impostazioni con l'uso di schede.</li>\n<li>Dimensione del download nella tabella non viene mostrata in byte ma in KB, MB o GB. E' comunque possibile ripristinare la visione precedente tramite il pannello \"impostazioni\" e riavviando il programma.</li>\n<li>Su mac OSX ora l'app nella dock appare con l'icona corretta e col nome giusto</li>\n<li>Aggiunta la data di ultimo aggiornamento database</li>\n<li>Completamente rivisito e corretto il sistema di aggiornamento database automatico ogni 24ore o manuale cliccando sul pulsante apposito...ora funziona e non presenta più i bug riscontrati nella versione beta1 con l'uscita di iOS5</li>\n<li>Il sistema di auto-aggiornamento ora verificherà anche la correttezza dell'updater e della nuova versione del programma tramite SHA, per evitare di eseguire applicazioni pericolose.</li>\n<li>Moltissimi bugfix in tutto il programma e in tutte le funzionalità</li>\n<li>Migliorate le prestazioni</li>\n<li>Inserito sistema totalmente anonimo per scopi statistici sull'uso del programma</li>\n<li>e altre modifiche che ora non mi vengono in mente ma che ci sono di certo... XD</li>\n</ul>", 
    "releases" : "<ul>\n<li>04/11/2015 - <b>BYAManager 1.0.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v1.0.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-100.html\">HERE</a></li>\n<li>04/10/2015 - <b>BYAManager 0.9.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.9.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-090.html\">HERE</a></li>\n<li>04/06/2015 - <b>BYAManager 0.8.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.8.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-080.html\">HERE</a></li>\n<li>04/03/2015 - <b>BYAManager 0.7.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.7.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-070.html\">HERE</a></li>\n<li>04/02/2015 - <b>BYAManager 0.6.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.6.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/bya-manager-060.html\">HERE</a></li>\n<li>03/30/2015 - <b>BYAManager 0.5.6</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.6\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/byamanager-056.html\">HERE</a> </li>\n<li>03/29/2015 - <b>BYAManager 0.5.5</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.5\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/changelog-0.html\">HERE</a></li>\n<li>10/21/2014 - <b>BYAManager 0.5.4</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/10/changelog-0.html\">HERE</a></li>\n<li>09/29/2014 - <b>BYAManager 0.5.3</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/09/byamanager-053.html\">HERE</a><br></li>\n<li>04/06/2012 - <b>BYAManager 0.5.2</b> public <a href=\"http://www.biteyourapple.net/2012/05/12/esclusiva-bya-bya-manager-0-5-2/#more-43579\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/04/anteprima-byamanager-052.html\">HERE</a></li>\n<li>04/05/2012 - <b>BYAManager 0.5.2 RC1</b> public via Twitter and auto-update</li>\n<li>03/28/2012 - <b>BYAManager 0.5.1</b> public <a href=\"http://www.biteyourapple.net/2012/04/06/esclusiva-bya-bya-manager-0-5-1/#more-43275\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/03/anteprima-byamanager-051.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0.0</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-050.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC2</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC1</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 beta 1</b> only for 3 beta testers</li>\n<li>03/13/2012 - <b>BYAManager 0.5.0.0 Beta5</b> only for beta testers</li>\n<li>03/09/2012 - <b>BYAManager 0.5.0.0 Beta3</b> only for beta testers </li>\n<li>02/24/2012 - <b>BYAManager 0.4.1.0 (or 0.5.0.0 Beta2)</b> only for beta testers</li>\n<li>01/06/2012 - <b>BYAManager 0.4.0 (or Beta 4)</b> public <a href=\"http://www.biteyourapple.net/2012/01/06/esclusiva-bya-biteyourapple-manager-0-4-0/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-beta4.html\">HERE</a></li>\n<li>12/28/2011 - <b>BYAManager Beta 3</b> public <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta3-preview.html\">HERE</a></li>\n<li>10/24/2011 - <b>BYAManager Beta 2</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta2.html\">HERE</a> </li>\n<li>10/10/2011 - <b>BYAManager Beta 1</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta1.html\">HERE</a></li>\n<li>10/03/2011 - <b>BYAManager Beta 0.3</b> private</li>\n<li>08/04/2011 - <b>BYAManager Alpha 4</b> private</li>\n<li>07/31/2011 - <b>BYAManager Alpha 3</b> private</li>\n</ul>", 
    "features" : "<h4>You can:</h4>\n\n<ul>\n<li>download files via http and https, also with BYAManager in background (minimized)</li>\n<li>download one or more files at the same time at full speed (Download Accelerator), with multiple processes to bypass server's limitations</li>\n<li>play/pause/stop/cancel downloads, using a list of available iOS Firmware and iTunes versions in a local database</li>\n<li>enable/disable sha1 check (enabled by default)</li>\n<li>search new BYAManager's versions or new database's versions</li>\n<li>change settings, for example: path of the download folder, proxy, measurement unit, language, buffer size, notifications, and so on</li>\n<li>restore settings to default values</li>\n<li>open the download folder, directly from BYAManager</li>\n<li>re-download files in the list directly in the browser, or in other programs</li>\n<li>control some important features running BYAManager via Command Line with a complete tutorial executing \"BYAManager.jar help\"</li>\n<li>move a completed download into the iTunes folder (only on Mac and Windows) to be able to update/restore your device from iTunes without re-download the file \".ipsw\".</li>\n</ul>\n\n<h4>BYAManager:</h4>\n\n<ul>\n<li>checks and updates itself automatically every 24 hours, with BYAUpdater</li>\n<li>checks and updates automatically the databse every 24 hours</li>\n<li>downloads files at full speed using multiple process</li>\n<li>checks the integrity os a file with hash algoririthm (SHA1).</li>\n<li>tries to restore incompleted/damaged files, during the startup of the program</li>\n<li>checks if a file has been downloaded before</li>\n<li>logs every actions in a file called BYAManager.log, near the executable</li>\n</ul>", 
    "futureExtensions" : "<h4>Functionalities</h4>\n\n<ul>\n<li>Add a pattern to the sha check </li>\n<li>Improve the logic to check the free space on the disk</li>\n<li>Dinamically update the list of available firmwares and iTunes versions, without the requirement of \"restart BYAManager to apply\".</li>\n<li>Add social networks integration: Twitter, Facebook and so on</li>\n</ul>\n\n<h4>GUI</h4>\n\n<ul>\n<li>Create a new modern GUI to release BYAManager 2.0 (NOT IN SWING, but with other frameworks, like JavaFX)</li>\n<li>Create a custom GUI for the popup in the system tray</li>\n<li>Add in the GUI some informations to help the user to understand the state of every process</li>\n<li>Add the donate button in the GUI</li>\n</ul>", 
    "licenseText" : "<p>Copyright 2011-2015 Stefano Cappa</p>\n\n<p>Licensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at</p>\n\nhttp://www.apache.org/licenses/LICENSE-2.0\n\n<p>Unless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.</p>\n\n<p><br>\n<b>Created by Stefano Cappa</b></p>", 
    "license" : "apache-v2", 
    "visible" : true, 
    "lastUpdate" : ISODate("2013-07-15T22:00:00.000+0000"), 
    "gallery" : [
        {
            "thumb" : "assets/images/projects/superapp/1.png", 
            "img" : "assets/images/projects/superapp/1.png", 
            "description" : "Image 1"
        }, 
        {
            "thumb" : "assets/images/projects/superapp/2.png", 
            "img" : "assets/images/projects/superapp/2.png", 
            "description" : "Image 2"
        }
    ], 
    "projectHomeView" : {
        "carouselImagePath" : "http://placehold.it/1000x400", 
        "carouselText" : "sdjs fshfs fhfsdhf", 
        "thumbImagePath" : "http://placehold.it/720x300", 
        "thumbText" : "sfsfasf", 
        "bigThumbImagePath" : "http://placehold.it/500x500", 
        "bigThumbText" : "dasdasdas"
    }, 
    "authors" : [
        {
            "name" : "dasdasdas", 
            "surname" : "dsadasd", 
            "url" : "http://shjdjhdj", 
            "urlAvailable" : true
        }, 
        {
            "name" : "dsfdsgsdgd", 
            "surname" : "werewweggew", 
            "url" : "http://dsgwgewg", 
            "urlAvailable" : true
        }, 
        {
            "name" : "jiomdwqdqw", 
            "surname" : "iuytdgbpl,", 
            "url" : "http://mxiuwfybe", 
            "urlAvailable" : false
        }
    ]
}
{ 
    "_id" : ObjectId("57632b61009f08db1623b608"), 
    "name" : "SWIMv2", 
    "url" : "https://github.com/Ks89/SWIMv2", 
    "iconPath" : "assets/images/projects/project_icons/spf.png", 
    "shortDescription" : "dsffsduhfsduaf asfyhasfuas fy8shfuiqw fUWQHBFUIWEBQ fewhfuwfnoeiwb ewuhfiewn", 
    "tags" : [
        "java se", 
        "maven", 
        "university"
    ], 
    "description" : "BYAManager is a personal project that i realized in 2011 and updated more times during the years. It's a Multi-Platform and Multi-Language software dedicated to the \"Apple World\", that i developed for the blog called BiteYourApple.\nThis software is a GUI to download iOS firmwares and iTunes versions with some extra features.\nIt's legal, obviously, because all files are on Apple server. BYAManager gets files directly from Apple server to you.\n<br/>\nIt's available in 3 languages: ITALIAN, ENGLISH and CZECH\n<br/>\nThe entire list of features is available <a href=\"https://github.com/Ks89/BYAManager#features\">HERE</a>.\n<br/>\nBYAManager uses <a href=\"https://github.com/Ks89/BYAUpdater\">BYAUpdater</a> to update itself automatically!\n<br/>\nI presented this software in 2011 <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a>\n<br/>\nAttention!!! I started this project on assembla.com with SVN. The source code and the commit's list are in Assembla in a private repository. This isn't important, because the code here on GitHub is better.\n<br/>\nI'm working on a Python script to sort the ipsw's links in the database.\nThis project is available <a href=\"https://github.com/Ks89/BYAMSorter\">HERE</a>. \nIn the future, i want to integrate this script in BYAManager.\n<br/>\n<b>This software requires Java 8 or above and an internet connection</b>", 
    "changelog" : "<ul>\n<li>NUOVA FUNZIONE: aggiunto nuovo parametro eseguendo BYAManager tramite linea di comando. Comunque si tratta una funzione da utenti esperti e che serve più a me che ad altri ;)</li>\n<li>RISOLTO BUG MINORE: ultimo bug conosciuto da tempo, risolto. Cioè, forzando l'aggiornamento del db o del programma, l'interfaccia grafica non si congela più per qualche secondo. Ora non ne conosco di rilevanti.</li>\n</ul>\n\n<h5>0.9.0 - 10/04/2015</h5>\n\n<ul>\n<li>NUOVA FUNZIONE: ora se Apple rilascia un nuovo dispositivo, es Apple Watch, non dovrò far uscire un aggiornamento del programma (es la versione 0.9.1), ma mi basterà modificare i dati sul mio server, così magicamente, nei menu a tendina del programma, appariranno le scritte coi nomi commerciali di questi prodotti Apple (è comunque richiesto un riavvio, dopo la mia modifica, ovvio ;))</li>\n</ul>\n\n<h5>0.8.0 - 06/04/2015</h5>\n\n<ul>\n<li>PREMESSA: da diversi mesi Apple rilascia le versioni di iTunes anche con link https. Inoltre, ha fatto si che tutte le versioni di iTunes siano scaricabili con https. Infatti, ora si può scaricare tutte le versioni di iTunes sia tramite collegamento http, sia https. Quindi, è evidente che vada verso https.\nBYAManager non è stato pensato per supportare connessioni https, così ho dovuto estendere il programma e potenziare notevolmente il sistema di download.</li>\n<li>LA MIA SOLUZIONE: In questa versione ho aggiunto proprio la possibilità di scaricare file via https (per ora senza accelerazione dei download). Questa funzione è già abilitata, ma per una questione di sicurezza, cercherò di usare solo link http, fino a che Apple non rilascerà solo versioni con https. Fino a questo giorno, continuerò a migliorare la parte https, in preparazione di quel momento.\nPoiché non so quando avverrà quel momento, ho deciso di aggiungere il supporto e abilitarlo direttamente nella versione 0.8.0. Se apple rilascerà il nuovo iOS (magari per l'Apple Watch) o iTunes SOLO via https, non servirà aggiornare il programma, poiché l'ho già preparato per quel momento grazie alla versione 0.8.0.</li>\n</ul>\n\n<h5>0.7.0 - 03/04/2015</h5>\n\n<ul>\n<li>Nuovissimo sistema di logging, per creare il file BYAManager.log e portato anche su BYAUpdater.</li>\n<li>Aggiornamento librerie per il download dei file.</li>\n<li>Riabilitato il proxy HTTP nelle impostazioni (attenzione assicurasi di trovare un proxy a prestazioni elevate).</li>\n<li>Corretto bug che lanciava messaggio d'errore durante la reinizializzazione del programma. In realtà la funzionalità era ok, ma c'era un messaggio d'errore inutile.</li>\n</ul>\n\n<h5>0.6.0 - 02/04/2015</h5>\n\n<ul>\n<li>Definitivamente corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux e anche Windows, presente da anni. Ho cambiato proprio il metodo per farlo, usando le nuove funzioni di java.</li>\n<li>Miglioramento generale delle performance nel processo di download.</li>\n<li>Completamente rifatto il sistema di connessione al server.</li>\n<li>Completamente rivisto il sistema per il download dei firmware e itunes. Ora è più facile da estendere per riabilitare i proxy, nella 0.7.0.</li>\n</ul>\n\n<h5>0.5.6 - 03/30/2015</h5>\n\n<ul>\n<li>Corretto problema nel sistema di auto-aggiornamento per Mac OSX e Linux, presente da anni.</li>\n<li>NOTA BENE per gli utenti Windows: assicuratevi di eseguire BYAManager.jar da una cartella in cui nel percorso non appaiono spazi. E' un bug che ho corretto per MAC OSX e LINUX, mentre per Windows ci vuole ancora un po' di pazienza. Devo trovare un attimo libero e lo correggo facilmente.</li>\n</ul>\n\n<h5>0.5.5 - 03/29/2015</h5>\n\n<ul>\n<li>Cambiamento del server che gestisce gli aggiornamenti. Non avendo più il precedente, tutte le versioni di questo programma (prima della 0.5.5) non sono più supportate, sia nel funzionamento, sia negli aggiornamenti. </li>\n<li>Aggiornate dipendenze varie di librerie usate internamente.</li>\n</ul>\n\n<h5>0.5.4 - 10/21/2014</h5>\n\n<ul>\n<li>Aggiornato ai nuovi dispositivi</li>\n</ul>\n\n<h5>0.5.3 - 09/29/2014</h5>\n\n<ul>\n<li>Versione uscita dopo più di 2 anni di attesa per rendere di nuovo funzionante il programma.</li>\n<li>Aggiunti nuovi dispositivi e database</li>\n<li>Richiede Java 8 o superiore</li>\n<li>Aggiornate tutte le librerie interne</li>\n<li>Attenzione: l'auto-aggiornamento di itunes non va perchè semplicemente apple cambia metodo ogni 2 secondi ed è impossibile fare un sistema davvero efficace. Invece, quello dei firmware non ha mai avuto problemi in anni e anni XD</li>\n</ul>\n\n<h5>0.5.2 - 04/06/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>La colonna della tabella chiamata \"Versione\" non ha piu' nessun logo a fianco. Il logo del file ipsw e' stato spostato nella prima colonna, nel caso in download sia di un firmware.</li>\n<li>Aggiunti i pulsanti per eseguire le azioni di spostamento ed esecuzione</li>\n<li>Aggiunta la voce nel popup (prima era chiamata COMING SOON) per disabilitare il controllo della sha1</li>\n</ul>\n\n<p>NOVITA’ IN FUNZIONALITA'</p>\n\n<ul>\n<li>Comando update-software finalmente completato e funzionante (in realta' andava anche nella 0.5.1 :) anche se con alcuni possibili errori)</li>\n<li>Cliccando col tasto destro su una riga della tabella (con un download in corso o in pausa) si puo' scegliere se disabilitare la verifica della SHA1 al termine del download. Questa procedura (verifica dell'hash tramite algoritmo sha1, identificata dall'icona fucsia col punto esclamativo) assicura la correttezza del file scaricato, ma potrebbe richiedere del tempo ( a volta anche un minuto) e un notevole spreco di risorse. Vista la crescente affidabilita' del programma, ho deciso di dare all'utente la possibilita' di disabilitare la procedura per ottenere il file desiderato piu' rapidamente.</li>\n<li>Aggiunta tutta la logica per gestire le azioni di esecuzione e spostamento dei download termimati</li>\n<li>Aggiunto GOD BETA1 (Guardian of download) per tenere sotto controllo i download, la loro velocita' e il fatto che alcuni processi non si blocchino senza motivo</li>\n</ul>\n\n<h5>0.5.1 - 03/28/2012</h5>\n\n<p>NOVITA' GRAFICHE</p>\n\n<ul>\n<li>Rimosso il limite di ridimensionamento dello sfondo della finestra del programma per risoluzioni superiori a 1920x<strong><em>. - Infatti, fino ad ora, la finestra principale del programma mostrava lo sfondo con una dimensione massima di 1920x</em></strong>, con quelle superiori appariva lo sfondo grigio. Ora non accade più. Adesso lo sfondo viene disegnato in modo molto piu’ efficiente.</li>\n<li>Rifatte le icone download, validation ecc… nella tabella</li>\n<li>Aggiunti i bordi nei popupmenu (come il menu file, help ecc…in alto oppure quello che appare cliccando col tasto destro su un download nella tabella) e migliorati i “separator” tra gli elementi di questi menu.</li>\n<li>Aggiunta voce nel popupmenu della tabella chiamata “coming soon”, che in futuro sara’ sostituita dalla reale funzione </li>\n<li>Ora la velocità globale non appare più come “0″, ma se è 0 perchè i download sono fermi o non ce ne sono non appare nulla (vuoto)</li>\n<li>La finestra preferenze appare a centro schermo e da ora se dovessi modificare la dimensione predefinita di una finestra il posizionamento al centro avviene in automatico (cosi’ evito i problemi col pannello delle preferenze).</li>\n<li>Migliorata SplashScreen per adattarla meglio alla grafica del programma</li>\n<li>Cambiata dimensione predefinita del programma (+ lungo) e ricentrata.</li>\n<li>Aggiunto autoridimensionamento delle colonne della tabella (ancora da perfezionare)</li>\n<li>Nella colonna della velocita’ ora non appare nulla se il download e’ in pausa (velocita’ ==0)</li>\n<li>Colonna “ora fine” rimossa e migliorata quella del tempo rimanente che ora dice h, m e s in modo preciso.</li>\n</ul>\n\n<p>NOVITA’ GENERICHE</p>\n\n<ul>\n<li>Praticamente riscritta la gestione della GUI per essere piu’ adattabile.</li>\n<li>Aggiornamento delle librerie di terze parti</li>\n<li>Aggiunto comando update-software, ma ancora in beta e non provato in caso di aggiornamento reale</li>\n<li>La fase di verifica nuove versioni software non richiede piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>La fase di verifica corretteza file JAR durante un agg software non richiedono piu’ la scrittura di dati sul disco (maggiori performance)</li>\n<li>Pulizia ed ottimizzazione del codice.</li>\n<li>Aggiunta suddivisione tra stati merging e validation. Il primo avviene sempre alla fine di ogni download (identificato dal simbolo +) e consiste nell’unire i vari file part che compongono il download per fornire il file desiderato. Il secondo può avvenire dopo al merging (per ora è sempre obbligatorio, nella 0.6.0 non lo sarà più) e consiste nel verificare tramite l’algoritmo SHA1 la correttezza del file scaricato. Questo metodo è lo stesso che consiglia Apple e che anche iTunes, probabilmente, esegue.</li>\n</ul>\n\n<p>CORREZIONE BUG (BUGFIX)</p>\n\n<ul>\n<li>Rimossa una lettura+scrittura di un file di oltre 600KB di testo ad ogni verifica degli aggiornamenti con Apple. Ora l’intera operazione è svolta in modo super-efficiente e in un tempo praticamente impercettibile. Questo permette di rendere molto piu’ veloce la verifica degli aggiornamenti dei firmware con Apple (un grazie allo sviluppatore della libreria che uso per averla aggiornata in modo da risolvere il mio problema , dopo averlo contattato via email, da solo non ci sarei mai riuscito!!!).</li>\n<li>Corretto GRAVISSIMO bug durante l’avvio e di conseguenza non avviene più nessuna scrittura superflua sul disco. </li>\n<li>CORRETTO GRAVE BUG CHE IMPEDIVA L’AUTO-AGGIORNAMENTO DEL PROGRAMMA</li>\n<li>Corretto bug nella gestione del pulsante per verificare gli aggiornamenti software</li>\n<li>Corretto bug su abilitazione/disabilitazione delle voci nel menu help: agg software e agg database</li>\n<li>Corretto problema nella generazione dei path sul disco per i pc con la partizione di sistema diversa da “C” (windows)</li>\n</ul>\n\n<h5>0.5.0.0 - 03/19/2012</h5>\n\n<p>Changelog 0.5.0.0 FINALE (news rispetto la RC2): </p>\n\n<ul>\n<li>Testato per bene il sistema di autoaggiornamento database e del programma</li>\n<li>Migliorato il menu del programma con una divisione delle voci più intelligente</li>\n<li>Messaggi nella splashscreen tradotti in inglese e italiano</li>\n<li>Aggiunta traduzione inglese sui nuovi componenti della gui</li>\n</ul>\n\n<p>Changelog 0.5.0 RC2:</p>\n\n<ul>\n<li>Corretto grave bug nell'aggiornamento delle versioni di iTunes perche' non caricava il db aggiornato all'avvio, ma quello precedente. In realta' mancava un sacco di codice per questa parte :) errore mio XD.</li>\n<li>Corretto grave bug nell'aggiornamento delle preferenze, sembrava risolto ma e' tornato ancora :) Ora spero di averlo rimosso.</li>\n</ul>\n\n<p>Changelog 0.5.0 RC1:</p>\n\n<ul>\n<li>Aggiunto download versioni di iTunes e preparato gia' per i tool per il Jailbreak</li>\n<li>Aggiunto sistema di autoaggiornamento delle versioni di iTunes direttamente dal server Apple.</li>\n<li>Il database usato dal programma e' ora compresso per dimezzarne la dimensione. Questo porta alla novita' seguente...</li>\n<li>Ridotto il consumo di banda (internet) durante l'avvio del programma (AD OGNI AVVIO).</li>\n<li>Corretto grave bug nel sistema di aggiornamento delle preferenze (presente dalla 0.4.0 alla 0.5.0beta4 [non rilasciata al pubblico]).</li>\n<li>Funzionante \"update-db\" da linea di comando. Grazie ad esso e' possibile risolvere problemi sul caricamento del database al momento dell'avvio in tutta semplicità. Questo comando rimuove i database esistenti e scarica le versioni piu' recenti dal server, dopodiche' cerca anche di aggiornarli contattando Apple. Terminato il processo, il software viene chiuso e al riavvio (normale con doppio clic) avrai i database aggiornati.</li>\n<li>Corretto il bug: \"se 4 i temp file vengono rinominati manualmente o a causa di un problema in BYAM e poi avvio il prog, lui giustamente non li carica, ma non li rimuove nemmeno, sia nel caso in cui il download sia incompleto sia nel caso fosse terminato. Ovviamente, se il firmware non puo' essere trovato, i sui part non servono e devono essere rimossi.\"</li>\n<li>Corretto il bug: \"Se per errore il file .sha si trova in temp al prossimo riavvio veniva cancellato, ora invece viene spostato tra i download ed appare una richiesta all'utente su che fare\"</li>\n<li>Rivisto il pannello delle impostazioni con la possibilita' di personalizzare le notifiche e inserire i valori per il Proxy</li>\n<li>Separati i file delle traduzioni tra normale, preferenze e messaggi di notifica.</li>\n<li>GUI separata dalla logica del programma per il 50%, il processo, lento e complicato richiedera' del tempo per essere perfezionato</li>\n<li>Cambiato ordine dei firmware, dal piu' recente al piu' vecchio</li>\n<li>Cambiato ordine dispositivi in modo piu' intelligente e aggiunti nuovi nomi commerciali AppleTV3 e iPad3</li>\n<li>Creato messaggio con spunta che avvisa alla prima riduzione ad icona</li>\n<li>Aggiunto il supporto ad ArchLinux 2011 (ultmi update con kernel 3.1.x.x) sia con KDE sia con Gnome</li>\n<li>Ora si puo' rinizializzare il programma anche durante la fase di aggiornamento del database</li>\n<li>Aggiunte le icone di itunes nella tabella</li>\n<li>Cambiate alcune scritte nella splashscreen </li>\n<li>Corretti bug minori</li>\n<li>Ottimizzazione di alcune procedure e migliorato il codice per renderlo + facile da aggiornare in futuro</li>\n</ul>\n\n<h5>0.4.0 - 01/06/2012</h5>\n\n<p>CHANGELOG </p>\n\n<ul>\n<li>Ora il programma si chiamerà BYAManager 0.4.0 e non più beta4, visto che questa versione non merita il nome beta, dopotutto è stabile.</li>\n<li>Aggiunta la spashScreen prima dell'avvio dell'interfaccia grafica del programma</li>\n<li>RISOLTO IMPORTANTISSIMO BUG NEL SISTEMA DI AUTOAGGIORNAMENTO DEL DATABASE DEI FIRMWARE E DIVERSE NOVITA' PER RENDERLO ANCORA PIU' AUTOMATIZZATO </li>\n<li>CON LA  0.4.0, DOPO AVERLO SCARICATO, IL NUMERO DI RIAVVI PER INSTALLARE IL NUOVO DATABASE SI E' RIDOTTO DRASTICAMENTE, ORA FA TUTTO LUI ECCETTO UN CASO PARTICOLARE CHE NON SI PUO' EVITARE (POCHI MINUTI/ORE DOPO L'USCITA DI NUOVI FIRMWARE/DISPOSITIVI).</li>\n<li>RIABILITATI GLI AUTOAGGIORNAMETI (IN BETA 3 HO DISATTIVATO TUTTO) PER LE VERSIONI SUPERIORI ALLA 0.4.0 (SISTEMA 1000 VOLTE PIU' SICURO RISPETTO QUELLO USATO PRIMA DELLA BETA3) </li>\n<li>Interrompendo download al 99% durante unione delle 4 parti, al riavvio il processo continua correttamente, a differenza della beta3</li>\n<li>Interrompendo download al 99% durante la validation, al riavvio il processo viene verificato chiedendo all'utente cosa fare</li>\n<li>Cambiati i nomi commerciali aggiungendo gli spazi e la scritta \"touch\" con la G su consiglio di Filippo Rossi di BYAStaff</li>\n<li>Il pannello preferenze non manda + i download in pausa nemmeno modificando le impostazioni, perchè esse saranno applicate al riavvio</li>\n<li>Ora si puo' cambiare il percorso dei download e poi continuare a scaricare nella cartella prima del cambiamento senza problemi per poter far si che le modifiche abbiamo effetto bisogna per forza riavviare il programma.</li>\n<li>Pannello delle preferenze completamente rivisto e gestito in modo differente e migliore.</li>\n<li>Si puo' cambiare il percorso di download scrivendo direttamente nel campo di testo nel pannello preferenze</li>\n<li>Su OSX ora appare il nome di BYAManager nella barra in alto e non + logica.main</li>\n<li>Corretto bug grafico nella toolbar che causava la rimozione dell'effetto arrotondato</li>\n<li>Ora i testi presenti nei pulsanti verdi e personalizzati appaiono ben centrati</li>\n<li>Modificato e ottimizzato il sistema di gestione dei pulsanti della toolbar (risolto un bug su windows7 che causava un comportamento anomalo nella versione prebeta3 rilasciata solo allo staff di BYA. Per nasconderlo temporaneamente avevo adottato una tecnica folle che richiedeva troppe risorse)</li>\n<li>Rimosso i pulsanti STOP e anche la riga nel popup sulla tabella. Ora un pulsante ferma e rimuove automaticamente, tutto in uno</li>\n<li>Rimosse diverse immagini presenti nel programma che gestivano lo stato STOP, riducendo la dimensione del file jar</li>\n<li>Aggiunta la traduzione in ceco inviatami da un utente</li>\n<li>Durante la fase di validation non si può più mettere in pausa o cancellare un download (come giusto che sia)</li>\n<li>Cambiamenti alle colonne della tabella (IMPORTANTE per i prossimi aggiornamenti), tra cui: la versione di iOS e la build sono integrate nella stessa colonna \"versione\" e dispositivo e' sostituito da \"tipo\".</li>\n<li>Aggiunta voce per ridurre ad icona il programma nel menu file</li>\n<li>Corretto bug nella gestione del Logger</li>\n<li>Corretti altri bug grafici minori e poco visibili</li>\n<li>Corretti altri bug funzionali minori</li>\n</ul>\n\n<h5>Beta 3 - 12/28/2011</h5>\n\n<ul>\n<li>AGGIUNTA l'interfaccia grafica in stile BYA e riposizionati molti elementi (cambiata la textfield nelle impostazioni con un menu a tendina e personalizzato ogni elemento grafico).</li>\n<li>AGGIUNTA la velocità globale di download (somma delle velocità di ogni singolo download ed aggiornata ogni secondo).</li>\n<li>AGGIUNTA la compatibilità con JAVA 7</li>\n<li>AGGIUNTA la possibilità di inviare comandi via terminale per avviare il programma secondo diverse modalità, proprio come in redSn0w (utile per risolvere problemi di avvio e per reinizializzare/aggiornare il programma)</li>\n<li>OTTIMIZZAZIONE dell'intero programma e di alcune procedure di ricerca</li>\n<li>RIMOSSA (momentaneamente) la splash screen in attesa di una versione migliore</li>\n<li>AGGIUNTA la doppia lingua in base a quella dell'OS (italiano, inglese)</li>\n<li>MIGLIORATO il sistema di autoaggiornamento</li>\n<li>CORRETTO bug gravissimo che causava consumi spropositati di CPU...ora si attesta tra l'8 e il 20% con tantissimi download ;) direi che è perfetto.</li>\n<li>INTERAMENTE riscritto il sistema di Download per supportare connessioni contemporanee thread-safe aumentando di un centinaio di volte le prestazioni e riducendo moltissimi tempi di attesa non giustificati.</li>\n<li>INTERAMENTE rivisto il codice di tutto il programma (usando ove possibile i Design Pattern), ottimizzazione spinta tanto da ridurre di ben 30MB il consumo della RAM, pulendo/semplificando anche il codice e permettendomi di aggiornarlo e modificarlo più velocemente.</li>\n<li>Rivisto il progetto del programma per aumentare la riusabilita', preparandomi per il riciclo del codice nel caso sviluppassi un nuovo progetto per BYA.</li>\n<li>INTERAMENTE riscritto il sistema per calcolare velocità, tempo rimanente e data fine che ora avviene nello stesso istante (ogni secondo) per tutti i download in lista permettendo di stimare facilmente la velocità globale senza commettere errori eccessivi. Questo novità porta con sè un'enorme ottimizzazione della RAM usata, infatti ora vengono risparmiati più di 10 MB semplicemente riscrivendo questa piccola, ma importantissima, funzione. C'è ancora lavoro da fare per ridurre gli sprechi, ma per ora è più che accettabile XD.</li>\n<li>Corretto il bug presente nelle versioni alpha8, alpha9, beta1 e beta2 che causava un \"lampeggio\" della tabella quando si cancellava un download completato e sopra di esso ve ne era un altro completato (senza altri in stati differenti). C'è voluto un sacco ma finalmente ho trovato il difetto, bastava aggiungere una sola riga di codice per correggerlo ;)</li>\n<li>Diversi bug (ALCUNI RILEVANTI) corretti in tutto il programma</li>\n<li>PULIZIA del codice e miglioramenti vari</li>\n<li>Possibilità di scegliere come visualizzare la dimensione dei file nella tabella tra Byte, Multipli del Byte (tiene conto del fattore 1000) [PREDEFINITO per comodità] o Multipli del Binary Byte (tiene conto del fattore 1024). Quindi, aggiunto menu' a tendina del pannello delle preferenze.</li>\n</ul>\n\n<h5>Beta 2 - 10/24/2011</h5>\n\n<ul>\n<li>Migliorata la grafica aggiungendo icone nella tabella, riducendo la dimensione della toolbar (impedendone anche lo spostamento), riprogrettando il pannello impostazioni con l'uso di schede.</li>\n<li>Dimensione del download nella tabella non viene mostrata in byte ma in KB, MB o GB. E' comunque possibile ripristinare la visione precedente tramite il pannello \"impostazioni\" e riavviando il programma.</li>\n<li>Su mac OSX ora l'app nella dock appare con l'icona corretta e col nome giusto</li>\n<li>Aggiunta la data di ultimo aggiornamento database</li>\n<li>Completamente rivisito e corretto il sistema di aggiornamento database automatico ogni 24ore o manuale cliccando sul pulsante apposito...ora funziona e non presenta più i bug riscontrati nella versione beta1 con l'uscita di iOS5</li>\n<li>Il sistema di auto-aggiornamento ora verificherà anche la correttezza dell'updater e della nuova versione del programma tramite SHA, per evitare di eseguire applicazioni pericolose.</li>\n<li>Moltissimi bugfix in tutto il programma e in tutte le funzionalità</li>\n<li>Migliorate le prestazioni</li>\n<li>Inserito sistema totalmente anonimo per scopi statistici sull'uso del programma</li>\n<li>e altre modifiche che ora non mi vengono in mente ma che ci sono di certo... XD</li>\n</ul>", 
    "releases" : "<ul>\n<li>04/11/2015 - <b>BYAManager 1.0.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v1.0.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-100.html\">HERE</a></li>\n<li>04/10/2015 - <b>BYAManager 0.9.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.9.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-090.html\">HERE</a></li>\n<li>04/06/2015 - <b>BYAManager 0.8.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.8.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-080.html\">HERE</a></li>\n<li>04/03/2015 - <b>BYAManager 0.7.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.7.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/byamanager-070.html\">HERE</a></li>\n<li>04/02/2015 - <b>BYAManager 0.6.0</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.6.0\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/04/bya-manager-060.html\">HERE</a></li>\n<li>03/30/2015 - <b>BYAManager 0.5.6</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.6\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/byamanager-056.html\">HERE</a> </li>\n<li>03/29/2015 - <b>BYAManager 0.5.5</b> <a href=\"https://github.com/Ks89/BYAManager/releases/tag/v0.5.5\">DOWNLOAD HERE</a> and public release <a href=\"http://ks89-jailbreak.blogspot.it/2015/03/changelog-0.html\">HERE</a></li>\n<li>10/21/2014 - <b>BYAManager 0.5.4</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/10/changelog-0.html\">HERE</a></li>\n<li>09/29/2014 - <b>BYAManager 0.5.3</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2014/09/byamanager-053.html\">HERE</a><br></li>\n<li>04/06/2012 - <b>BYAManager 0.5.2</b> public <a href=\"http://www.biteyourapple.net/2012/05/12/esclusiva-bya-bya-manager-0-5-2/#more-43579\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/04/anteprima-byamanager-052.html\">HERE</a></li>\n<li>04/05/2012 - <b>BYAManager 0.5.2 RC1</b> public via Twitter and auto-update</li>\n<li>03/28/2012 - <b>BYAManager 0.5.1</b> public <a href=\"http://www.biteyourapple.net/2012/04/06/esclusiva-bya-bya-manager-0-5-1/#more-43275\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/03/anteprima-byamanager-051.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0.0</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-050.html\">HERE</a></li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC2</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 RC1</b> public via Twitter and auto-update</li>\n<li>03/19/2012 - <b>BYAManager 0.5.0 beta 1</b> only for 3 beta testers</li>\n<li>03/13/2012 - <b>BYAManager 0.5.0.0 Beta5</b> only for beta testers</li>\n<li>03/09/2012 - <b>BYAManager 0.5.0.0 Beta3</b> only for beta testers </li>\n<li>02/24/2012 - <b>BYAManager 0.4.1.0 (or 0.5.0.0 Beta2)</b> only for beta testers</li>\n<li>01/06/2012 - <b>BYAManager 0.4.0 (or Beta 4)</b> public <a href=\"http://www.biteyourapple.net/2012/01/06/esclusiva-bya-biteyourapple-manager-0-4-0/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2012/01/anteprima-byamanager-beta4.html\">HERE</a></li>\n<li>12/28/2011 - <b>BYAManager Beta 3</b> public <a href=\"http://www.biteyourapple.net/2011/12/28/esclusiva-bya-biteyourapple-manager-beta-3/\">HERE</a> and <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta3-preview.html\">HERE</a></li>\n<li>10/24/2011 - <b>BYAManager Beta 2</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta2.html\">HERE</a> </li>\n<li>10/10/2011 - <b>BYAManager Beta 1</b> public <a href=\"http://ks89-jailbreak.blogspot.it/2011/10/bya-manager-beta1.html\">HERE</a></li>\n<li>10/03/2011 - <b>BYAManager Beta 0.3</b> private</li>\n<li>08/04/2011 - <b>BYAManager Alpha 4</b> private</li>\n<li>07/31/2011 - <b>BYAManager Alpha 3</b> private</li>\n</ul>", 
    "features" : "<h4>You can:</h4>\n\n<ul>\n<li>download files via http and https, also with BYAManager in background (minimized)</li>\n<li>download one or more files at the same time at full speed (Download Accelerator), with multiple processes to bypass server's limitations</li>\n<li>play/pause/stop/cancel downloads, using a list of available iOS Firmware and iTunes versions in a local database</li>\n<li>enable/disable sha1 check (enabled by default)</li>\n<li>search new BYAManager's versions or new database's versions</li>\n<li>change settings, for example: path of the download folder, proxy, measurement unit, language, buffer size, notifications, and so on</li>\n<li>restore settings to default values</li>\n<li>open the download folder, directly from BYAManager</li>\n<li>re-download files in the list directly in the browser, or in other programs</li>\n<li>control some important features running BYAManager via Command Line with a complete tutorial executing \"BYAManager.jar help\"</li>\n<li>move a completed download into the iTunes folder (only on Mac and Windows) to be able to update/restore your device from iTunes without re-download the file \".ipsw\".</li>\n</ul>\n\n<h4>BYAManager:</h4>\n\n<ul>\n<li>checks and updates itself automatically every 24 hours, with BYAUpdater</li>\n<li>checks and updates automatically the databse every 24 hours</li>\n<li>downloads files at full speed using multiple process</li>\n<li>checks the integrity os a file with hash algoririthm (SHA1).</li>\n<li>tries to restore incompleted/damaged files, during the startup of the program</li>\n<li>checks if a file has been downloaded before</li>\n<li>logs every actions in a file called BYAManager.log, near the executable</li>\n</ul>", 
    "futureExtensions" : "<h4>Functionalities</h4>\n\n<ul>\n<li>Add a pattern to the sha check </li>\n<li>Improve the logic to check the free space on the disk</li>\n<li>Dinamically update the list of available firmwares and iTunes versions, without the requirement of \"restart BYAManager to apply\".</li>\n<li>Add social networks integration: Twitter, Facebook and so on</li>\n</ul>\n\n<h4>GUI</h4>\n\n<ul>\n<li>Create a new modern GUI to release BYAManager 2.0 (NOT IN SWING, but with other frameworks, like JavaFX)</li>\n<li>Create a custom GUI for the popup in the system tray</li>\n<li>Add in the GUI some informations to help the user to understand the state of every process</li>\n<li>Add the donate button in the GUI</li>\n</ul>", 
    "licenseText" : "<p>Copyright 2011-2015 Stefano Cappa</p>\n\n<p>Licensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at</p>\n\nhttp://www.apache.org/licenses/LICENSE-2.0\n\n<p>Unless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.</p>\n\n<p><br>\n<b>Created by Stefano Cappa</b></p>", 
    "license" : "apache-v2", 
    "visible" : true, 
    "lastUpdate" : ISODate("2013-07-15T22:00:00.000+0000"), 
    "gallery" : [
        {
            "thumb" : "assets/images/projects/spf/1.png", 
            "img" : "assets/images/projects/spf/1.png", 
            "description" : "Image 1"
        }, 
        {
            "thumb" : "assets/images/projects/spf/2.png", 
            "img" : "assets/images/projects/spf/2.png", 
            "description" : "Image 2"
        }
    ], 
    "projectHomeView" : {

    }, 
    "authors" : [
        {
            "name" : "dasdasdas", 
            "surname" : "dsadasd", 
            "url" : "http://shjdjhdj", 
            "urlAvailable" : true
        }, 
        {
            "name" : "dsfdsgsdgd", 
            "surname" : "werewweggew", 
            "url" : "http://dsgwgewg", 
            "urlAvailable" : true
        }, 
        {
            "name" : "jiomdwqdqw", 
            "surname" : "iuytdgbpl,", 
            "url" : "http://mxiuwfybe", 
            "urlAvailable" : false
        }
    ]
}
